pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                    File 'pic18_metrics_analysis.cpp'                      *
//                        Generated by version 2.5.0                         *
//                       july 7th, 2013, at 19h32'22"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_metrics_analysis.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*

#include "piccolo_options.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_metrics_analysis.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//                     Routine 'exploreInstructionList'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_exploreInstructionList (GALGAS_instructionList inArgument0,
                                     GALGAS_lstring inArgument1,
                                     GALGAS_routineCallGraph & ioArgument2,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'computeStackLevelsFromLine'                    *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeStackLevelsFromLine (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument0,
                                         const GALGAS_uint constinArgument1,
                                         const GALGAS_symbolTableForOptimizations constinArgument2,
                                         const GALGAS_symbolTableForStackLevels constinArgument3,
                                         GALGAS_uintlist & ioArgument4,
                                         GALGAS_stringset & ioArgument5,
                                         GALGAS_string & ioArgument6,
                                         C_Compiler * inCompiler
                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'computeStackLevelsFromLabel'                   *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeStackLevelsFromLabel (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument0,
                                          const GALGAS_lstring constinArgument1,
                                          const GALGAS_symbolTableForOptimizations constinArgument2,
                                          const GALGAS_symbolTableForStackLevels constinArgument3,
                                          GALGAS_uintlist & ioArgument4,
                                          GALGAS_uint & outArgument5,
                                          GALGAS_stringset & ioArgument6,
                                          GALGAS_string & ioArgument7,
                                          C_Compiler * inCompiler
                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                        Routine 'computeStackNeeds'                        *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeStackNeeds (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument0,
                                const GALGAS_lstringlist constinArgument1,
                                GALGAS_string & ioArgument2,
                                C_Compiler * inCompiler
                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                 Routine 'searchForLoopInInstructionList'                  *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_searchForLoopInInstructionList (GALGAS_instructionList inArgument0,
                                             const GALGAS_routineHasLoopMap constinArgument1,
                                             GALGAS_bool & outArgument2,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'computeMinMaxFromLine'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeMinMaxFromLine (const GALGAS_uint constinArgument0,
                                    const GALGAS_symbolTableForOptimizations constinArgument1,
                                    const GALGAS_routineMinMaxMap constinArgument2,
                                    const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument3,
                                    GALGAS_uintlist & ioArgument4,
                                    const GALGAS_uint constinArgument5,
                                    GALGAS_uint & ioArgument6,
                                    GALGAS_uintlist & ioArgument7,
                                    const GALGAS_uint constinArgument8,
                                    GALGAS_uint & ioArgument9,
                                    C_Compiler * inCompiler
                                    COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                     Routine 'computeMinMaxFromLabel'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeMinMaxFromLabel (const GALGAS_lstring constinArgument0,
                                     const GALGAS_symbolTableForOptimizations constinArgument1,
                                     const GALGAS_routineMinMaxMap constinArgument2,
                                     const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument3,
                                     GALGAS_uintlist & ioArgument4,
                                     const GALGAS_uint constinArgument5,
                                     GALGAS_uint & ioArgument6,
                                     GALGAS_uintlist & ioArgument7,
                                     const GALGAS_uint constinArgument8,
                                     GALGAS_uint & ioArgument9,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                         '@routineCallGraph' graph                         *
//                                                                           *
//---------------------------------------------------------------------------*

GALGAS_routineCallGraph::GALGAS_routineCallGraph (void) :
AC_GALGAS_graph () {
}

//---------------------------------------------------------------------------*

