pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
GALGAS_routineCallGraph GALGAS_routineCallGraph::constructor_emptyGraph (LOCATION_ARGS) {
  GALGAS_routineCallGraph result ;
  result.makeNewEmptyGraph (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_routineCallGraph::modifier_addNode (GALGAS_lstring inKey,
                                                GALGAS_string inArgument_0,
                                                C_Compiler * inCompiler
                                                COMMA_LOCATION_ARGS) {
  capCollectionElement attributes ;
  GALGAS_stringlist::makeAttributesFromObjects (attributes, inArgument_0 COMMA_THERE) ;
  const char * kErrorMessage = "the '%K' routine is already declared at %L" ;
  internalAddNode (inKey, kErrorMessage, attributes, inCompiler COMMA_THERE) ;
}


//---------------------------------------------------------------------------*

void GALGAS_routineCallGraph::method_topologicalSort (GALGAS_stringlist & outSortedList,
                                                      GALGAS_lstringlist & outSortedKeyList,
                                                      GALGAS_stringlist & outUnsortedList,
                                                      GALGAS_lstringlist & outUnsortedKeyList,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) const {
  cSharedList * sortedList = NULL ;
  cSharedList * unsortedList = NULL ;
  internalTopologicalSort (sortedList, outSortedKeyList, unsortedList, outUnsortedKeyList, inCompiler COMMA_THERE) ;
  outSortedList = GALGAS_stringlist (sortedList) ;
  outUnsortedList = GALGAS_stringlist (unsortedList) ;
  GALGAS_stringlist::detachSharedList (sortedList) ;
  GALGAS_stringlist::detachSharedList (unsortedList) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                          @routineCallGraph type                           *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_routineCallGraph ("routineCallGraph",
                                         NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_routineCallGraph::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_routineCallGraph ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_routineCallGraph::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_routineCallGraph (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineCallGraph GALGAS_routineCallGraph::extractObject (const GALGAS_object & inObject,
                                                                C_Compiler * inCompiler,
                                                                const GALGAS_location & inErrorLocation,
                                                                const GALGAS_string & inErrorMessage
                                                                COMMA_LOCATION_ARGS) {
  GALGAS_routineCallGraph result ;
  const GALGAS_routineCallGraph * p = (const GALGAS_routineCallGraph *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_routineCallGraph *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                     Routine 'exploreInstructionList'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_exploreInstructionList (GALGAS_instructionList inArgument_inInstructionList,
                                     GALGAS_lstring inArgument_inRoutineName,
                                     GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                     C_Compiler * inCompiler
                                     COMMA_UNUSED_LOCATION_ARGS) {
  cEnumerator_instructionList enumerator_3551 (inArgument_inInstructionList, kEnumeration_up) ;
  while (enumerator_3551.hasCurrentObject ()) {
    callCategoryMethod_enterCallInGraph ((const cPtr_piccolo_5F_instruction *) enumerator_3551.current_mInstruction (HERE).ptr (), inArgument_inRoutineName, ioArgument_ioRoutineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (104)) ;
    enumerator_3551.gotoNextObject () ;
  }
}


//---------------------------------------------------------------------------*

cMapElement_symbolTableForStackLevels::cMapElement_symbolTableForStackLevels (const GALGAS_lstring & inKey,
                                                                              const GALGAS_uint & in_mStackLevel
                                                                              COMMA_LOCATION_ARGS) :
cMapElement (inKey COMMA_THERE),
mAttribute_mStackLevel (in_mStackLevel) {
}

//---------------------------------------------------------------------------*

bool cMapElement_symbolTableForStackLevels::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mStackLevel.isValid () ;
}

//---------------------------------------------------------------------------*

cMapElement * cMapElement_symbolTableForStackLevels::copy (void) {
  cMapElement * result = NULL ;
  macroMyNew (result, cMapElement_symbolTableForStackLevels (mAttribute_lkey, mAttribute_mStackLevel COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

