pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
void cMapElement_symbolTableForStackLevels::description (C_String & ioString, const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mStackLevel" ":" ;
  mAttribute_mStackLevel.description (ioString, inIndentation) ;
}

//---------------------------------------------------------------------------*

typeComparisonResult cMapElement_symbolTableForStackLevels::compare (const cCollectionElement * inOperand) const {
  cMapElement_symbolTableForStackLevels * operand = (cMapElement_symbolTableForStackLevels *) inOperand ;
  typeComparisonResult result = mAttribute_lkey.objectCompare (operand->mAttribute_lkey) ;
  if (kOperandEqual == result) {
    result = mAttribute_mStackLevel.objectCompare (operand->mAttribute_mStackLevel) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels::GALGAS_symbolTableForStackLevels (void) :
AC_GALGAS_map () {
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels::GALGAS_symbolTableForStackLevels (const GALGAS_symbolTableForStackLevels & inSource) :
AC_GALGAS_map (inSource) {
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels & GALGAS_symbolTableForStackLevels::operator = (const GALGAS_symbolTableForStackLevels & inSource) {
  * ((AC_GALGAS_map *) this) = inSource ;
  return * this ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels GALGAS_symbolTableForStackLevels::constructor_emptyMap (LOCATION_ARGS) {
  GALGAS_symbolTableForStackLevels result ;
  result.makeNewEmptyMap (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels GALGAS_symbolTableForStackLevels::constructor_mapWithMapToOverride (const GALGAS_symbolTableForStackLevels & inMapToOverride
                                                                                                     COMMA_LOCATION_ARGS) {
  GALGAS_symbolTableForStackLevels result ;
  result.makeNewEmptyMapWithMapToOverride (inMapToOverride COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels GALGAS_symbolTableForStackLevels::reader_overriddenMap (UNUSED_LOCATION_ARGS) const {
  GALGAS_symbolTableForStackLevels result ;
  getOverridenMap (result) ;
  return result ;
}
//---------------------------------------------------------------------------*

void GALGAS_symbolTableForStackLevels::modifier_insertKey (GALGAS_lstring inKey,
                                                           GALGAS_uint inArgument0,
                                                           C_Compiler * inCompiler
                                                           COMMA_LOCATION_ARGS) {
  cMapElement_symbolTableForStackLevels * p = NULL ;
  macroMyNew (p, cMapElement_symbolTableForStackLevels (inKey, inArgument0 COMMA_HERE)) ;
  capCollectionElement attributes ;
  attributes.setPointer (p) ;
  macroDetachSharedObject (p) ;
  const char * kInsertErrorMessage = "the '%K' label is already declared in %L" ;
  const char * kShadowErrorMessage = "" ;
  performInsert (attributes, inCompiler, kInsertErrorMessage, kShadowErrorMessage COMMA_THERE) ;
}

//---------------------------------------------------------------------------*

const char * kSearchErrorMessage_symbolTableForStackLevels_searchKey = "the '%K' label is not declared" ;

//---------------------------------------------------------------------------*

void GALGAS_symbolTableForStackLevels::method_searchKey (GALGAS_lstring inKey,
                                                         GALGAS_uint & outArgument0,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) const {
  const cMapElement_symbolTableForStackLevels * p = (const cMapElement_symbolTableForStackLevels *) performSearch (inKey,
                                                                                                                     inCompiler,
                                                                                                                     kSearchErrorMessage_symbolTableForStackLevels_searchKey
                                                                                                                     COMMA_THERE) ;
  if (NULL == p) {
    outArgument0.drop () ;
  }else{
    macroValidSharedObject (p, const cMapElement_symbolTableForStackLevels) ;
    outArgument0 = p->mAttribute_mStackLevel ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_symbolTableForStackLevels::reader_mStackLevelForKey (const GALGAS_string & inKey,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_LOCATION_ARGS) const {
  const cCollectionElement * attributes = searchForReadingAttribute (inKey, inCompiler COMMA_THERE) ;
  const cMapElement_symbolTableForStackLevels * p = (const cMapElement_symbolTableForStackLevels *) attributes ;
  GALGAS_uint result ;
  if (NULL != p) {
    macroValidSharedObject (p, const cMapElement_symbolTableForStackLevels) ;
    result = p->mAttribute_mStackLevel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_symbolTableForStackLevels::modifier_setMStackLevelForKey (GALGAS_uint inAttributeValue,
                                                                      GALGAS_string inKey,
                                                                      C_Compiler * inCompiler
                                                                      COMMA_LOCATION_ARGS) {
  cCollectionElement * attributes = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_symbolTableForStackLevels * p = (cMapElement_symbolTableForStackLevels *) attributes ;
  if (NULL != p) {
    macroValidSharedObject (p, cMapElement_symbolTableForStackLevels) ;
    p->mAttribute_mStackLevel = inAttributeValue ;
  }
}

//---------------------------------------------------------------------------*

cMapElement_symbolTableForStackLevels * GALGAS_symbolTableForStackLevels::readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                                    const GALGAS_string & inKey
                                                                                                                    COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_symbolTableForStackLevels * result = (cMapElement_symbolTableForStackLevels *) p ;
  macroNullOrValidSharedObject (result, cMapElement_symbolTableForStackLevels) ;
  return result ;
}

//---------------------------------------------------------------------------*

