pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
cMapElement_symbolTableForStackLevels * GALGAS_symbolTableForStackLevels::readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                                       const GALGAS_lstring & inKey
                                                                                                                       COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler, kSearchErrorMessage_symbolTableForStackLevels_searchKey COMMA_THERE) ;
  cMapElement_symbolTableForStackLevels * result = (cMapElement_symbolTableForStackLevels *) p ;
  macroNullOrValidSharedObject (result, cMapElement_symbolTableForStackLevels) ;
  return result ;
}

//---------------------------------------------------------------------------*

cEnumerator_symbolTableForStackLevels::cEnumerator_symbolTableForStackLevels (const GALGAS_symbolTableForStackLevels & inEnumeratedObject,
                                                                              const typeEnumerationOrder inOrder) :
cGenericAbstractEnumerator () {
  inEnumeratedObject.populateEnumerationArray (mEnumerationArray, inOrder) ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels_2E_element cEnumerator_symbolTableForStackLevels::current (LOCATION_ARGS) const {
  const cMapElement_symbolTableForStackLevels * p = (const cMapElement_symbolTableForStackLevels *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_symbolTableForStackLevels) ;
  return GALGAS_symbolTableForStackLevels_2E_element (p->mAttribute_lkey, p->mAttribute_mStackLevel) ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring cEnumerator_symbolTableForStackLevels::current_lkey (LOCATION_ARGS) const {
  const cMapElement * p = (const cMapElement *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement) ;
  return p->mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cEnumerator_symbolTableForStackLevels::current_mStackLevel (LOCATION_ARGS) const {
  const cMapElement_symbolTableForStackLevels * p = (const cMapElement_symbolTableForStackLevels *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_symbolTableForStackLevels) ;
  return p->mAttribute_mStackLevel ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                      @symbolTableForStackLevels type                      *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_symbolTableForStackLevels ("symbolTableForStackLevels",
                                                  NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_symbolTableForStackLevels::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_symbolTableForStackLevels ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_symbolTableForStackLevels::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_symbolTableForStackLevels (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels GALGAS_symbolTableForStackLevels::extractObject (const GALGAS_object & inObject,
                                                                                  C_Compiler * inCompiler,
                                                                                  const GALGAS_location & inErrorLocation,
                                                                                  const GALGAS_string & inErrorMessage
                                                                                  COMMA_LOCATION_ARGS) {
  GALGAS_symbolTableForStackLevels result ;
  const GALGAS_symbolTableForStackLevels * p = (const GALGAS_symbolTableForStackLevels *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_symbolTableForStackLevels *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'computeStackLevelsFromLine'                    *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeStackLevelsFromLine (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                         const GALGAS_uint constinArgument_inStartLine,
                                         const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                         const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                         GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                         GALGAS_stringset & ioArgument_ioExploredLineSet,
                                         GALGAS_string & ioArgument_ioListFileContents,
                                         C_Compiler * inCompiler
                                         COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint var_currentLine = constinArgument_inStartLine ;
  GALGAS_bool var_explores = GALGAS_bool (true) ;
  if (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (400)).isValid ()) {
    PMUInt32 variant_13839 = constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (400)).uintValue () ;
    bool loop_13839 = true ;
    while (loop_13839) {
      loop_13839 = var_explores.isValid () ;
      if (loop_13839) {
        loop_13839 = var_explores.boolValue () ;
      }
      if (loop_13839 && (0 == variant_13839)) {
        loop_13839 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (400)) ;
      }
      if (loop_13839) {
        variant_13839 -- ;
        GALGAS_string var_currentLineString = var_currentLine.reader_string (SOURCE_FILE_AT_LINE (401)) ;
        const enumGalgasBool test_0 = ioArgument_ioExploredLineSet.reader_hasKey (var_currentLineString COMMA_SOURCE_FILE_AT_LINE (402)).boolEnum () ;
        if (kBoolTrue == test_0) {
          var_explores = GALGAS_bool (false) ;
        }else if (kBoolFalse == test_0) {
          ioArgument_ioExploredLineSet.addAssign_operation (var_currentLine.reader_string (SOURCE_FILE_AT_LINE (405)) COMMA_SOURCE_FILE_AT_LINE (405)) ;
          GALGAS_pic_31__38__5F_intermediate_5F_instruction var_instruction = constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (406)) ;
          callCategoryMethod_exploreStackNeeds ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) var_instruction.ptr (), constinArgument_inGeneratedInstructionList, constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, var_currentLine, ioArgument_ioStackNeedsArray, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (407)) ;
          var_explores = callCategoryReader_nextInstructionIsReachable ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) var_instruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (416)) ;
          var_currentLine = var_currentLine.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (417)) ;
        }
      }
    }
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'computeStackLevelsFromLabel'                   *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeStackLevelsFromLabel (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                          const GALGAS_lstring constinArgument_inStartLabel,
                                          const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                          const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                          GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                          GALGAS_uint & outArgument_outInstructionStackNeeds,
                                          GALGAS_stringset & ioArgument_ioExploredLineSet,
                                          GALGAS_string & ioArgument_ioListFileContents,
                                          C_Compiler * inCompiler
                                          COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outInstructionStackNeeds.drop () ; // Release 'out' argument
  GALGAS_uint var_currentLine ;
  GALGAS_bool joker_15128_0 ; // Joker input parameter
  constinArgument_inSymbolTable.method_searchKey (constinArgument_inStartLabel, var_currentLine, joker_15128_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (434)) ;
  {
  routine_computeStackLevelsFromLine (constinArgument_inGeneratedInstructionList, var_currentLine, constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (435)) ;
  }
  outArgument_outInstructionStackNeeds = ioArgument_ioStackNeedsArray.reader_mValueAtIndex (var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (444)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                        Routine 'computeStackNeeds'                        *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeStackNeeds (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                const GALGAS_lstringlist constinArgument_inSortedRoutineNames,
                                GALGAS_string & ioArgument_ioListFileContents,
                                C_Compiler * inCompiler
                                COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_symbolTableForOptimizations var_symbolTable = GALGAS_symbolTableForOptimizations::constructor_emptyMap (SOURCE_FILE_AT_LINE (455)) ;
  cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_15831 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
  GALGAS_uint index_15825 ((PMUInt32) 0) ;
  while (enumerator_15831.hasCurrentObject ()) {
    callCategoryMethod_defineLabel ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_15831.current_mInstruction (HERE).ptr (), var_symbolTable, index_15825, inCompiler COMMA_SOURCE_FILE_AT_LINE (457)) ;
    enumerator_15831.gotoNextObject () ;
    index_15825.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (456)) ;
  }
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n"
    "Stack needs:\n") COMMA_SOURCE_FILE_AT_LINE (460)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Routine").reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 70U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (461)).operator_concat (GALGAS_string (" Levels\n") COMMA_SOURCE_FILE_AT_LINE (461)) COMMA_SOURCE_FILE_AT_LINE (461)) ;
  GALGAS_symbolTableForStackLevels var_stackLevelMap = GALGAS_symbolTableForStackLevels::constructor_emptyMap (SOURCE_FILE_AT_LINE (462)) ;
  cEnumerator_lstringlist enumerator_16186 (constinArgument_inSortedRoutineNames, kEnumeration_up) ;
  while (enumerator_16186.hasCurrentObject ()) {
    const enumGalgasBool test_0 = var_symbolTable.reader_hasKey (enumerator_16186.current_mValue (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (464)).operator_not (SOURCE_FILE_AT_LINE (464)).boolEnum () ;
    if (kBoolTrue == test_0) {
      ioArgument_ioListFileContents.dotAssign_operation (enumerator_16186.current_mValue (HERE).mAttribute_string.reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 70U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (465)).operator_concat (GALGAS_string (" inlined\n") COMMA_SOURCE_FILE_AT_LINE (465)) COMMA_SOURCE_FILE_AT_LINE (465)) ;
    }else if (kBoolFalse == test_0) {
      GALGAS_stringset var_exploredLineSet = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (467)) ;
      GALGAS_uintlist var_stackRequirementArray = GALGAS_uintlist::constructor_emptyList (SOURCE_FILE_AT_LINE (468)) ;
      cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_16473 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
      while (enumerator_16473.hasCurrentObject ()) {
        var_stackRequirementArray.addAssign_operation (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (470)) COMMA_SOURCE_FILE_AT_LINE (470)) ;
        enumerator_16473.gotoNextObject () ;
      }
      {
      GALGAS_uint joker_16714_0 ; // Joker input parameter
      routine_computeStackLevelsFromLabel (constinArgument_inGeneratedInstructionList, enumerator_16186.current_mValue (HERE), var_symbolTable, var_stackLevelMap, var_stackRequirementArray, joker_16714_0, var_exploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (472)) ;
      }
      GALGAS_uint var_maxStackNeeds = GALGAS_uint ((PMUInt32) 0U) ;
      cEnumerator_uintlist enumerator_16849 (var_stackRequirementArray, kEnumeration_up) ;
      while (enumerator_16849.hasCurrentObject ()) {
        const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, enumerator_16849.current_mValue (HERE).objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (484)))).operator_and (GALGAS_bool (kIsStrictSup, enumerator_16849.current_mValue (HERE).objectCompare (var_maxStackNeeds)) COMMA_SOURCE_FILE_AT_LINE (484)).boolEnum () ;
        if (kBoolTrue == test_1) {
          var_maxStackNeeds = enumerator_16849.current_mValue (HERE) ;
        }
        enumerator_16849.gotoNextObject () ;
      }
      const enumGalgasBool test_2 = GALGAS_bool (gOption_galgas_5F_builtin_5F_options_verbose_5F_output.reader_value ()).boolEnum () ;
      if (kBoolTrue == test_2) {
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("------------------ ").operator_concat (enumerator_16186.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (489)) COMMA_SOURCE_FILE_AT_LINE (489)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (489)) COMMA_SOURCE_FILE_AT_LINE (489)) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" Line:level:\n") COMMA_SOURCE_FILE_AT_LINE (490)) ;
        cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_17223 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
        GALGAS_uint index_17217 ((PMUInt32) 0) ;
        while (enumerator_17223.hasCurrentObject ()) {
          GALGAS_uint var_stack = var_stackRequirementArray.reader_mValueAtIndex (index_17217, inCompiler COMMA_SOURCE_FILE_AT_LINE (492)) ;
          const enumGalgasBool test_3 = GALGAS_bool (kIsStrictInf, var_stack.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (493)))).boolEnum () ;
          if (kBoolTrue == test_3) {
            ioArgument_ioListFileContents.dotAssign_operation (index_17217.reader_string (SOURCE_FILE_AT_LINE (494)).reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 5U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (494)).operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (494)) COMMA_SOURCE_FILE_AT_LINE (494)) ;
            ioArgument_ioListFileContents.dotAssign_operation (var_stack.reader_string (SOURCE_FILE_AT_LINE (495)).reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 5U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (495)).operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (495)) COMMA_SOURCE_FILE_AT_LINE (495)) ;
            callCategoryMethod_display ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_17223.current_mInstruction (HERE).ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (496)) ;
            ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (497)) ;
          }
          enumerator_17223.gotoNextObject () ;
          index_17217.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (491)) ;
        }
        ioArgument_ioListFileContents.dotAssign_operation (enumerator_16186.current_mValue (HERE).mAttribute_string.operator_concat (GALGAS_string (" --> ") COMMA_SOURCE_FILE_AT_LINE (500)).operator_concat (var_maxStackNeeds.reader_string (SOURCE_FILE_AT_LINE (500)) COMMA_SOURCE_FILE_AT_LINE (500)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (500)) COMMA_SOURCE_FILE_AT_LINE (500)) ;
      }else if (kBoolFalse == test_2) {
        ioArgument_ioListFileContents.dotAssign_operation (enumerator_16186.current_mValue (HERE).mAttribute_string.reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 70U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (502)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (502)).operator_concat (var_maxStackNeeds.reader_string (SOURCE_FILE_AT_LINE (502)) COMMA_SOURCE_FILE_AT_LINE (502)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (502)) COMMA_SOURCE_FILE_AT_LINE (502)) ;
      }
      {
      var_stackLevelMap.modifier_insertKey (enumerator_16186.current_mValue (HERE), var_maxStackNeeds.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (504)), inCompiler COMMA_SOURCE_FILE_AT_LINE (504)) ;
      }
    }
    enumerator_16186.gotoNextObject () ;
  }
}


//---------------------------------------------------------------------------*

cMapElement_routineHasLoopMap::cMapElement_routineHasLoopMap (const GALGAS_lstring & inKey,
                                                              const GALGAS_bool & in_mHasLoop
                                                              COMMA_LOCATION_ARGS) :
cMapElement (inKey COMMA_THERE),
mAttribute_mHasLoop (in_mHasLoop) {
}

//---------------------------------------------------------------------------*

