pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
bool cMapElement_routineHasLoopMap::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mHasLoop.isValid () ;
}

//---------------------------------------------------------------------------*

cMapElement * cMapElement_routineHasLoopMap::copy (void) {
  cMapElement * result = NULL ;
  macroMyNew (result, cMapElement_routineHasLoopMap (mAttribute_lkey, mAttribute_mHasLoop COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

void cMapElement_routineHasLoopMap::description (C_String & ioString, const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mHasLoop" ":" ;
  mAttribute_mHasLoop.description (ioString, inIndentation) ;
}

//---------------------------------------------------------------------------*

typeComparisonResult cMapElement_routineHasLoopMap::compare (const cCollectionElement * inOperand) const {
  cMapElement_routineHasLoopMap * operand = (cMapElement_routineHasLoopMap *) inOperand ;
  typeComparisonResult result = mAttribute_lkey.objectCompare (operand->mAttribute_lkey) ;
  if (kOperandEqual == result) {
    result = mAttribute_mHasLoop.objectCompare (operand->mAttribute_mHasLoop) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap::GALGAS_routineHasLoopMap (void) :
AC_GALGAS_map () {
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap::GALGAS_routineHasLoopMap (const GALGAS_routineHasLoopMap & inSource) :
AC_GALGAS_map (inSource) {
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap & GALGAS_routineHasLoopMap::operator = (const GALGAS_routineHasLoopMap & inSource) {
  * ((AC_GALGAS_map *) this) = inSource ;
  return * this ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap GALGAS_routineHasLoopMap::constructor_emptyMap (LOCATION_ARGS) {
  GALGAS_routineHasLoopMap result ;
  result.makeNewEmptyMap (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap GALGAS_routineHasLoopMap::constructor_mapWithMapToOverride (const GALGAS_routineHasLoopMap & inMapToOverride
                                                                                     COMMA_LOCATION_ARGS) {
  GALGAS_routineHasLoopMap result ;
  result.makeNewEmptyMapWithMapToOverride (inMapToOverride COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap GALGAS_routineHasLoopMap::reader_overriddenMap (UNUSED_LOCATION_ARGS) const {
  GALGAS_routineHasLoopMap result ;
  getOverridenMap (result) ;
  return result ;
}
//---------------------------------------------------------------------------*

void GALGAS_routineHasLoopMap::modifier_insertKey (GALGAS_lstring inKey,
                                                   GALGAS_bool inArgument0,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) {
  cMapElement_routineHasLoopMap * p = NULL ;
  macroMyNew (p, cMapElement_routineHasLoopMap (inKey, inArgument0 COMMA_HERE)) ;
  capCollectionElement attributes ;
  attributes.setPointer (p) ;
  macroDetachSharedObject (p) ;
  const char * kInsertErrorMessage = "the '%K' routine is already declared in %L" ;
  const char * kShadowErrorMessage = "" ;
  performInsert (attributes, inCompiler, kInsertErrorMessage, kShadowErrorMessage COMMA_THERE) ;
}

//---------------------------------------------------------------------------*

const char * kSearchErrorMessage_routineHasLoopMap_searchKey = "the '%K' routine is not declared" ;

//---------------------------------------------------------------------------*

void GALGAS_routineHasLoopMap::method_searchKey (GALGAS_lstring inKey,
                                                 GALGAS_bool & outArgument0,
                                                 C_Compiler * inCompiler
                                                 COMMA_LOCATION_ARGS) const {
  const cMapElement_routineHasLoopMap * p = (const cMapElement_routineHasLoopMap *) performSearch (inKey,
                                                                                                     inCompiler,
                                                                                                     kSearchErrorMessage_routineHasLoopMap_searchKey
                                                                                                     COMMA_THERE) ;
  if (NULL == p) {
    outArgument0.drop () ;
  }else{
    macroValidSharedObject (p, const cMapElement_routineHasLoopMap) ;
    outArgument0 = p->mAttribute_mHasLoop ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_routineHasLoopMap::reader_mHasLoopForKey (const GALGAS_string & inKey,
                                                             C_Compiler * inCompiler
                                                             COMMA_LOCATION_ARGS) const {
  const cCollectionElement * attributes = searchForReadingAttribute (inKey, inCompiler COMMA_THERE) ;
  const cMapElement_routineHasLoopMap * p = (const cMapElement_routineHasLoopMap *) attributes ;
  GALGAS_bool result ;
  if (NULL != p) {
    macroValidSharedObject (p, const cMapElement_routineHasLoopMap) ;
    result = p->mAttribute_mHasLoop ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_routineHasLoopMap::modifier_setMHasLoopForKey (GALGAS_bool inAttributeValue,
                                                           GALGAS_string inKey,
                                                           C_Compiler * inCompiler
                                                           COMMA_LOCATION_ARGS) {
  cCollectionElement * attributes = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_routineHasLoopMap * p = (cMapElement_routineHasLoopMap *) attributes ;
  if (NULL != p) {
    macroValidSharedObject (p, cMapElement_routineHasLoopMap) ;
    p->mAttribute_mHasLoop = inAttributeValue ;
  }
}

//---------------------------------------------------------------------------*

cMapElement_routineHasLoopMap * GALGAS_routineHasLoopMap::readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                    const GALGAS_string & inKey
                                                                                                    COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_routineHasLoopMap * result = (cMapElement_routineHasLoopMap *) p ;
  macroNullOrValidSharedObject (result, cMapElement_routineHasLoopMap) ;
  return result ;
}

//---------------------------------------------------------------------------*

cMapElement_routineHasLoopMap * GALGAS_routineHasLoopMap::readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                       const GALGAS_lstring & inKey
                                                                                                       COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler, kSearchErrorMessage_routineHasLoopMap_searchKey COMMA_THERE) ;
  cMapElement_routineHasLoopMap * result = (cMapElement_routineHasLoopMap *) p ;
  macroNullOrValidSharedObject (result, cMapElement_routineHasLoopMap) ;
  return result ;
}

//---------------------------------------------------------------------------*

cEnumerator_routineHasLoopMap::cEnumerator_routineHasLoopMap (const GALGAS_routineHasLoopMap & inEnumeratedObject,
                                                              const typeEnumerationOrder inOrder) :
cGenericAbstractEnumerator () {
  inEnumeratedObject.populateEnumerationArray (mEnumerationArray, inOrder) ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap_2E_element cEnumerator_routineHasLoopMap::current (LOCATION_ARGS) const {
  const cMapElement_routineHasLoopMap * p = (const cMapElement_routineHasLoopMap *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_routineHasLoopMap) ;
  return GALGAS_routineHasLoopMap_2E_element (p->mAttribute_lkey, p->mAttribute_mHasLoop) ;
}

//---------------------------------------------------------------------------*

