pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
GALGAS_lstring cEnumerator_routineHasLoopMap::current_lkey (LOCATION_ARGS) const {
  const cMapElement * p = (const cMapElement *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement) ;
  return p->mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cEnumerator_routineHasLoopMap::current_mHasLoop (LOCATION_ARGS) const {
  const cMapElement_routineHasLoopMap * p = (const cMapElement_routineHasLoopMap *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_routineHasLoopMap) ;
  return p->mAttribute_mHasLoop ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                          @routineHasLoopMap type                          *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_routineHasLoopMap ("routineHasLoopMap",
                                          NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_routineHasLoopMap::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_routineHasLoopMap ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_routineHasLoopMap::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_routineHasLoopMap (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap GALGAS_routineHasLoopMap::extractObject (const GALGAS_object & inObject,
                                                                  C_Compiler * inCompiler,
                                                                  const GALGAS_location & inErrorLocation,
                                                                  const GALGAS_string & inErrorMessage
                                                                  COMMA_LOCATION_ARGS) {
  GALGAS_routineHasLoopMap result ;
  const GALGAS_routineHasLoopMap * p = (const GALGAS_routineHasLoopMap *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_routineHasLoopMap *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*

cMapElement_routineMinMaxMap::cMapElement_routineMinMaxMap (const GALGAS_lstring & inKey,
                                                            const GALGAS_uint & in_mMin,
                                                            const GALGAS_uint & in_mMax
                                                            COMMA_LOCATION_ARGS) :
cMapElement (inKey COMMA_THERE),
mAttribute_mMin (in_mMin),
mAttribute_mMax (in_mMax) {
}

//---------------------------------------------------------------------------*

bool cMapElement_routineMinMaxMap::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mMin.isValid () && mAttribute_mMax.isValid () ;
}

//---------------------------------------------------------------------------*

cMapElement * cMapElement_routineMinMaxMap::copy (void) {
  cMapElement * result = NULL ;
  macroMyNew (result, cMapElement_routineMinMaxMap (mAttribute_lkey, mAttribute_mMin, mAttribute_mMax COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

void cMapElement_routineMinMaxMap::description (C_String & ioString, const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mMin" ":" ;
  mAttribute_mMin.description (ioString, inIndentation) ;
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mMax" ":" ;
  mAttribute_mMax.description (ioString, inIndentation) ;
}

//---------------------------------------------------------------------------*

typeComparisonResult cMapElement_routineMinMaxMap::compare (const cCollectionElement * inOperand) const {
  cMapElement_routineMinMaxMap * operand = (cMapElement_routineMinMaxMap *) inOperand ;
  typeComparisonResult result = mAttribute_lkey.objectCompare (operand->mAttribute_lkey) ;
  if (kOperandEqual == result) {
    result = mAttribute_mMin.objectCompare (operand->mAttribute_mMin) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mMax.objectCompare (operand->mAttribute_mMax) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap::GALGAS_routineMinMaxMap (void) :
AC_GALGAS_map () {
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap::GALGAS_routineMinMaxMap (const GALGAS_routineMinMaxMap & inSource) :
AC_GALGAS_map (inSource) {
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap & GALGAS_routineMinMaxMap::operator = (const GALGAS_routineMinMaxMap & inSource) {
  * ((AC_GALGAS_map *) this) = inSource ;
  return * this ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap GALGAS_routineMinMaxMap::constructor_emptyMap (LOCATION_ARGS) {
  GALGAS_routineMinMaxMap result ;
  result.makeNewEmptyMap (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap GALGAS_routineMinMaxMap::constructor_mapWithMapToOverride (const GALGAS_routineMinMaxMap & inMapToOverride
                                                                                   COMMA_LOCATION_ARGS) {
  GALGAS_routineMinMaxMap result ;
  result.makeNewEmptyMapWithMapToOverride (inMapToOverride COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap GALGAS_routineMinMaxMap::reader_overriddenMap (UNUSED_LOCATION_ARGS) const {
  GALGAS_routineMinMaxMap result ;
  getOverridenMap (result) ;
  return result ;
}
//---------------------------------------------------------------------------*

