pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
void GALGAS_routineMinMaxMap::modifier_insertKey (GALGAS_lstring inKey,
                                                  GALGAS_uint inArgument0,
                                                  GALGAS_uint inArgument1,
                                                  C_Compiler * inCompiler
                                                  COMMA_LOCATION_ARGS) {
  cMapElement_routineMinMaxMap * p = NULL ;
  macroMyNew (p, cMapElement_routineMinMaxMap (inKey, inArgument0, inArgument1 COMMA_HERE)) ;
  capCollectionElement attributes ;
  attributes.setPointer (p) ;
  macroDetachSharedObject (p) ;
  const char * kInsertErrorMessage = "the '%K' routine is already declared in %L" ;
  const char * kShadowErrorMessage = "" ;
  performInsert (attributes, inCompiler, kInsertErrorMessage, kShadowErrorMessage COMMA_THERE) ;
}

//---------------------------------------------------------------------------*

const char * kSearchErrorMessage_routineMinMaxMap_searchKey = "the '%K' routine is not declared" ;

//---------------------------------------------------------------------------*

void GALGAS_routineMinMaxMap::method_searchKey (GALGAS_lstring inKey,
                                                GALGAS_uint & outArgument0,
                                                GALGAS_uint & outArgument1,
                                                C_Compiler * inCompiler
                                                COMMA_LOCATION_ARGS) const {
  const cMapElement_routineMinMaxMap * p = (const cMapElement_routineMinMaxMap *) performSearch (inKey,
                                                                                                   inCompiler,
                                                                                                   kSearchErrorMessage_routineMinMaxMap_searchKey
                                                                                                   COMMA_THERE) ;
  if (NULL == p) {
    outArgument0.drop () ;
    outArgument1.drop () ;
  }else{
    macroValidSharedObject (p, const cMapElement_routineMinMaxMap) ;
    outArgument0 = p->mAttribute_mMin ;
    outArgument1 = p->mAttribute_mMax ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_routineMinMaxMap::reader_mMinForKey (const GALGAS_string & inKey,
                                                        C_Compiler * inCompiler
                                                        COMMA_LOCATION_ARGS) const {
  const cCollectionElement * attributes = searchForReadingAttribute (inKey, inCompiler COMMA_THERE) ;
  const cMapElement_routineMinMaxMap * p = (const cMapElement_routineMinMaxMap *) attributes ;
  GALGAS_uint result ;
  if (NULL != p) {
    macroValidSharedObject (p, const cMapElement_routineMinMaxMap) ;
    result = p->mAttribute_mMin ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_routineMinMaxMap::reader_mMaxForKey (const GALGAS_string & inKey,
                                                        C_Compiler * inCompiler
                                                        COMMA_LOCATION_ARGS) const {
  const cCollectionElement * attributes = searchForReadingAttribute (inKey, inCompiler COMMA_THERE) ;
  const cMapElement_routineMinMaxMap * p = (const cMapElement_routineMinMaxMap *) attributes ;
  GALGAS_uint result ;
  if (NULL != p) {
    macroValidSharedObject (p, const cMapElement_routineMinMaxMap) ;
    result = p->mAttribute_mMax ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_routineMinMaxMap::modifier_setMMinForKey (GALGAS_uint inAttributeValue,
                                                      GALGAS_string inKey,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) {
  cCollectionElement * attributes = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_routineMinMaxMap * p = (cMapElement_routineMinMaxMap *) attributes ;
  if (NULL != p) {
    macroValidSharedObject (p, cMapElement_routineMinMaxMap) ;
    p->mAttribute_mMin = inAttributeValue ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_routineMinMaxMap::modifier_setMMaxForKey (GALGAS_uint inAttributeValue,
                                                      GALGAS_string inKey,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) {
  cCollectionElement * attributes = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_routineMinMaxMap * p = (cMapElement_routineMinMaxMap *) attributes ;
  if (NULL != p) {
    macroValidSharedObject (p, cMapElement_routineMinMaxMap) ;
    p->mAttribute_mMax = inAttributeValue ;
  }
}

//---------------------------------------------------------------------------*

cMapElement_routineMinMaxMap * GALGAS_routineMinMaxMap::readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                  const GALGAS_string & inKey
                                                                                                  COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_routineMinMaxMap * result = (cMapElement_routineMinMaxMap *) p ;
  macroNullOrValidSharedObject (result, cMapElement_routineMinMaxMap) ;
  return result ;
}

//---------------------------------------------------------------------------*

cMapElement_routineMinMaxMap * GALGAS_routineMinMaxMap::readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                     const GALGAS_lstring & inKey
                                                                                                     COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler, kSearchErrorMessage_routineMinMaxMap_searchKey COMMA_THERE) ;
  cMapElement_routineMinMaxMap * result = (cMapElement_routineMinMaxMap *) p ;
  macroNullOrValidSharedObject (result, cMapElement_routineMinMaxMap) ;
  return result ;
}

//---------------------------------------------------------------------------*

cEnumerator_routineMinMaxMap::cEnumerator_routineMinMaxMap (const GALGAS_routineMinMaxMap & inEnumeratedObject,
                                                            const typeEnumerationOrder inOrder) :
cGenericAbstractEnumerator () {
  inEnumeratedObject.populateEnumerationArray (mEnumerationArray, inOrder) ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap_2E_element cEnumerator_routineMinMaxMap::current (LOCATION_ARGS) const {
  const cMapElement_routineMinMaxMap * p = (const cMapElement_routineMinMaxMap *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_routineMinMaxMap) ;
  return GALGAS_routineMinMaxMap_2E_element (p->mAttribute_lkey, p->mAttribute_mMin, p->mAttribute_mMax) ;
}

//---------------------------------------------------------------------------*

