pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
GALGAS_lstring cEnumerator_routineMinMaxMap::current_lkey (LOCATION_ARGS) const {
  const cMapElement * p = (const cMapElement *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement) ;
  return p->mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cEnumerator_routineMinMaxMap::current_mMin (LOCATION_ARGS) const {
  const cMapElement_routineMinMaxMap * p = (const cMapElement_routineMinMaxMap *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_routineMinMaxMap) ;
  return p->mAttribute_mMin ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cEnumerator_routineMinMaxMap::current_mMax (LOCATION_ARGS) const {
  const cMapElement_routineMinMaxMap * p = (const cMapElement_routineMinMaxMap *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_routineMinMaxMap) ;
  return p->mAttribute_mMax ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                          @routineMinMaxMap type                           *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_routineMinMaxMap ("routineMinMaxMap",
                                         NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_routineMinMaxMap::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_routineMinMaxMap ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_routineMinMaxMap::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_routineMinMaxMap (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap GALGAS_routineMinMaxMap::extractObject (const GALGAS_object & inObject,
                                                                C_Compiler * inCompiler,
                                                                const GALGAS_location & inErrorLocation,
                                                                const GALGAS_string & inErrorMessage
                                                                COMMA_LOCATION_ARGS) {
  GALGAS_routineMinMaxMap result ;
  const GALGAS_routineMinMaxMap * p = (const GALGAS_routineMinMaxMap *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_routineMinMaxMap *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                 Routine 'searchForLoopInInstructionList'                  *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_searchForLoopInInstructionList (GALGAS_instructionList inArgument_inInstructionList,
                                             const GALGAS_routineHasLoopMap constinArgument_inRoutineHasLoopMap,
                                             GALGAS_bool & outArgument_outHasLoopInstruction,
                                             C_Compiler * inCompiler
                                             COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outHasLoopInstruction.drop () ; // Release 'out' argument
  outArgument_outHasLoopInstruction = GALGAS_bool (false) ;
  cEnumerator_instructionList enumerator_22318 (inArgument_inInstructionList, kEnumeration_up) ;
  bool bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (631)).isValidAndTrue () ;
  if (enumerator_22318.hasCurrentObject () && bool_0) {
    while (enumerator_22318.hasCurrentObject () && bool_0) {
      callCategoryMethod_searchForLoopInstruction ((const cPtr_piccolo_5F_instruction *) enumerator_22318.current_mInstruction (HERE).ptr (), constinArgument_inRoutineHasLoopMap, outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (632)) ;
      enumerator_22318.gotoNextObject () ;
      if (enumerator_22318.hasCurrentObject ()) {
        bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (631)).isValidAndTrue () ;
      }
    }
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'computeMinMaxFromLine'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeMinMaxFromLine (const GALGAS_uint constinArgument_inStartLine,
                                    const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                    const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                    const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                    GALGAS_uintlist & ioArgument_ioMinArray,
                                    const GALGAS_uint constinArgument_inCurrentMin,
                                    GALGAS_uint & ioArgument_ioExecutionMin,
                                    GALGAS_uintlist & ioArgument_ioMaxArray,
                                    const GALGAS_uint constinArgument_inCurrentMax,
                                    GALGAS_uint & ioArgument_ioExecutionMax,
                                    C_Compiler * inCompiler
                                    COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint var_currentLine = constinArgument_inStartLine ;
  GALGAS_bool var_explores = GALGAS_bool (true) ;
  GALGAS_uint var_min = constinArgument_inCurrentMin ;
  GALGAS_uint var_max = constinArgument_inCurrentMax ;
  if (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (1187)).isValid ()) {
    PMUInt32 variant_40162 = constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (1187)).uintValue () ;
    bool loop_40162 = true ;
    while (loop_40162) {
      loop_40162 = var_explores.isValid () ;
      if (loop_40162) {
        loop_40162 = var_explores.boolValue () ;
      }
      if (loop_40162 && (0 == variant_40162)) {
        loop_40162 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (1187)) ;
      }
      if (loop_40162) {
        variant_40162 -- ;
        const enumGalgasBool test_0 = GALGAS_bool (kIsStrictInf, var_min.objectCompare (ioArgument_ioMinArray.reader_mValueAtIndex (var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (1188)))).operator_or (GALGAS_bool (kIsStrictSup, var_max.objectCompare (ioArgument_ioMaxArray.reader_mValueAtIndex (var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (1188)))) COMMA_SOURCE_FILE_AT_LINE (1188)).boolEnum () ;
        if (kBoolTrue == test_0) {
          GALGAS_pic_31__38__5F_intermediate_5F_instruction var_instruction = constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (1189)) ;
          callCategoryMethod_duration ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) var_instruction.ptr (), var_currentLine, constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioMaxArray, var_min, var_max, ioArgument_ioExecutionMin, ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1190)) ;
          const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, var_min.objectCompare (ioArgument_ioMinArray.reader_mValueAtIndex (var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (1191)))).boolEnum () ;
          if (kBoolTrue == test_1) {
            {
            ioArgument_ioMinArray.modifier_setMValueAtIndex (var_min, var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (1192)) ;
            }
          }
          const enumGalgasBool test_2 = GALGAS_bool (kIsStrictSup, var_max.objectCompare (ioArgument_ioMaxArray.reader_mValueAtIndex (var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (1194)))).boolEnum () ;
          if (kBoolTrue == test_2) {
            {
            ioArgument_ioMaxArray.modifier_setMValueAtIndex (var_max, var_currentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (1195)) ;
            }
          }
          var_explores = callCategoryReader_nextInstructionIsReachable ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) var_instruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (1197)) ;
          var_currentLine = var_currentLine.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1198)) ;
        }else if (kBoolFalse == test_0) {
          var_explores = GALGAS_bool (false) ;
        }
      }
    }
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//                     Routine 'computeMinMaxFromLabel'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_computeMinMaxFromLabel (const GALGAS_lstring constinArgument_inLabel,
                                     const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                     const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                     const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                     GALGAS_uintlist & ioArgument_ioMinArray,
                                     const GALGAS_uint constinArgument_inCurrentMin,
                                     GALGAS_uint & ioArgument_ioExecutionMin,
                                     GALGAS_uintlist & ioArgument_ioMaxArray,
                                     const GALGAS_uint constinArgument_inCurrentMax,
                                     GALGAS_uint & ioArgument_ioExecutionMax,
                                     C_Compiler * inCompiler
                                     COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint var_line ;
  GALGAS_bool joker_41566_0 ; // Joker input parameter
  constinArgument_inSymbolTable.method_searchKey (constinArgument_inLabel, var_line, joker_41566_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1219)) ;
  {
  routine_computeMinMaxFromLine (var_line, constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, constinArgument_inCurrentMin, ioArgument_ioExecutionMin, ioArgument_ioMaxArray, constinArgument_inCurrentMax, ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1220)) ;
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'pic18_compute_metrics'                      *
//                                                                           *
//---------------------------------------------------------------------------*

