pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
void routine_pic_31__38__5F_compute_5F_metrics (const GALGAS_piccoloModel constinArgument_inPiccoloModel,
                                                const GALGAS_routineDeclarationList constinArgument_inUserRoutineDeclarationListForBootloaderImplementation,
                                                const GALGAS_routineDeclarationList constinArgument_inBootloaderRoutineDeclarationListForUserProgramImplementation,
                                                const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                GALGAS_string & ioArgument_ioListFileContents,
                                                const GALGAS_string constinArgument_inSourceFileName,
                                                C_Compiler * inCompiler
                                                COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_lstringlist var_sortedRoutineNameList ;
  GALGAS_stringset var_routinesInvolvedInRecursion ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*******************************************************************************\n") COMMA_SOURCE_FILE_AT_LINE (1250)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*           S T A C K    R E Q U I R E M E N T S                              *\n") COMMA_SOURCE_FILE_AT_LINE (1251)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*******************************************************************************\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (1252)) ;
  const enumGalgasBool test_0 = GALGAS_bool (gOption_piccolo_5F_options_doNotComputeStackRequirements.reader_value ()).boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("option '").operator_concat (GALGAS_string (gOption_piccolo_5F_options_doNotComputeStackRequirements.reader_string ()) COMMA_SOURCE_FILE_AT_LINE (1254)).operator_concat (GALGAS_string ("': stack requirements are not computed.\n") COMMA_SOURCE_FILE_AT_LINE (1254)) COMMA_SOURCE_FILE_AT_LINE (1254)) ;
    var_routinesInvolvedInRecursion = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (1255)) ;
    var_sortedRoutineNameList = GALGAS_lstringlist::constructor_emptyList (SOURCE_FILE_AT_LINE (1256)) ;
  }else if (kBoolFalse == test_0) {
    GALGAS_routineCallGraph var_routineCallGraph = GALGAS_routineCallGraph::constructor_emptyGraph (SOURCE_FILE_AT_LINE (1258)) ;
    cEnumerator_routineDefinitionList enumerator_43466 (constinArgument_inPiccoloModel.mAttribute_mRoutineDefinitionList, kEnumeration_up) ;
    while (enumerator_43466.hasCurrentObject ()) {
      {
      var_routineCallGraph.modifier_addNode (enumerator_43466.current_mRoutineName (HERE), enumerator_43466.current_mRoutineName (HERE).mAttribute_string, inCompiler COMMA_SOURCE_FILE_AT_LINE (1261)) ;
      }
      enumerator_43466.gotoNextObject () ;
    }
    cEnumerator_routineDeclarationList enumerator_43684 (constinArgument_inUserRoutineDeclarationListForBootloaderImplementation, kEnumeration_up) ;
    while (enumerator_43684.hasCurrentObject ()) {
      {
      var_routineCallGraph.modifier_addNode (enumerator_43684.current_mRoutineName (HERE), enumerator_43684.current_mRoutineName (HERE).mAttribute_string, inCompiler COMMA_SOURCE_FILE_AT_LINE (1265)) ;
      }
      enumerator_43684.gotoNextObject () ;
    }
    cEnumerator_routineDeclarationList enumerator_43909 (constinArgument_inBootloaderRoutineDeclarationListForUserProgramImplementation, kEnumeration_up) ;
    while (enumerator_43909.hasCurrentObject ()) {
      {
      var_routineCallGraph.modifier_addNode (enumerator_43909.current_mRoutineName (HERE), enumerator_43909.current_mRoutineName (HERE).mAttribute_string, inCompiler COMMA_SOURCE_FILE_AT_LINE (1269)) ;
      }
      enumerator_43909.gotoNextObject () ;
    }
    cEnumerator_interruptDefinitionList enumerator_44113 (constinArgument_inPiccoloModel.mAttribute_mInterruptDefinitionList, kEnumeration_up) ;
    while (enumerator_44113.hasCurrentObject ()) {
      GALGAS_lstring var_interruptRoutineName = GALGAS_lstring::constructor_new (GALGAS_string ("_").operator_concat (enumerator_44113.current_mInterruptName (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (1273)).operator_concat (GALGAS_string ("_interrupt_routine") COMMA_SOURCE_FILE_AT_LINE (1273)), enumerator_44113.current_mInterruptName (HERE).mAttribute_location COMMA_SOURCE_FILE_AT_LINE (1273)) ;
      {
      var_routineCallGraph.modifier_addNode (var_interruptRoutineName, var_interruptRoutineName.mAttribute_string, inCompiler COMMA_SOURCE_FILE_AT_LINE (1274)) ;
      }
      {
      routine_exploreInstructionList (enumerator_44113.current_mInstructionList (HERE), var_interruptRoutineName, var_routineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (1275)) ;
      }
      enumerator_44113.gotoNextObject () ;
    }
    cEnumerator_routineDefinitionList enumerator_44529 (constinArgument_inPiccoloModel.mAttribute_mRoutineDefinitionList, kEnumeration_up) ;
    while (enumerator_44529.hasCurrentObject ()) {
      {
      routine_exploreInstructionList (enumerator_44529.current_mInstructionList (HERE), enumerator_44529.current_mRoutineName (HERE), var_routineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (1279)) ;
      }
      enumerator_44529.gotoNextObject () ;
    }
    GALGAS_lstringlist var_unsortedNodeKeyList ;
    GALGAS_stringlist joker_44707_0 ; // Joker input parameter
    GALGAS_stringlist joker_44745_0 ; // Joker input parameter
    var_routineCallGraph.method_topologicalSort (joker_44707_0, var_sortedRoutineNameList, joker_44745_0, var_unsortedNodeKeyList, inCompiler COMMA_SOURCE_FILE_AT_LINE (1282)) ;
    var_routinesInvolvedInRecursion = GALGAS_stringset::constructor_setWithLStringList (var_unsortedNodeKeyList COMMA_SOURCE_FILE_AT_LINE (1288)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_unsortedNodeKeyList.reader_length (SOURCE_FILE_AT_LINE (1289)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_1) {
      GALGAS_string var_s = GALGAS_string ("stack needs cannot be computed, the following routines are involved in a recursion:") ;
      cEnumerator_lstringlist enumerator_45072 (var_unsortedNodeKeyList, kEnumeration_up) ;
      while (enumerator_45072.hasCurrentObject ()) {
        var_s.dotAssign_operation (GALGAS_string ("\n"
          "-  ").operator_concat (enumerator_45072.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (1292)) COMMA_SOURCE_FILE_AT_LINE (1292)) COMMA_SOURCE_FILE_AT_LINE (1292)) ;
        enumerator_45072.gotoNextObject () ;
      }
      inCompiler->emitSemanticWarning (constinArgument_inPiccoloModel.mAttribute_mEndOfProgram, var_s COMMA_SOURCE_FILE_AT_LINE (1294)) ;
      ioArgument_ioListFileContents.dotAssign_operation (var_s COMMA_SOURCE_FILE_AT_LINE (1295)) ;
    }else if (kBoolFalse == test_1) {
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("No recursive routines.\n") COMMA_SOURCE_FILE_AT_LINE (1297)) ;
    }
    const enumGalgasBool test_2 = GALGAS_bool (gOption_piccolo_5F_options_generateCallGraph.reader_value ()).boolEnum () ;
    if (kBoolTrue == test_2) {
      GALGAS_string var_graphvizText = var_routineCallGraph.reader_graphviz (SOURCE_FILE_AT_LINE (1301)) ;
      GALGAS_string var_graphvizFile = constinArgument_inSourceFileName.reader_stringByDeletingPathExtension (SOURCE_FILE_AT_LINE (1302)).operator_concat (GALGAS_string (".dot") COMMA_SOURCE_FILE_AT_LINE (1302)) ;
      GALGAS_bool joker_45608_0 ; // Joker input parameter
      var_graphvizText.method_writeToFileWhenDifferentContents (var_graphvizFile, joker_45608_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1303)) ;
    }
    const enumGalgasBool test_3 = GALGAS_bool (kIsEqual, var_unsortedNodeKeyList.reader_length (SOURCE_FILE_AT_LINE (1306)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_3) {
      {
      routine_computeStackNeeds (constinArgument_inGeneratedInstructionList, var_sortedRoutineNameList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1307)) ;
      }
    }
  }
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (1314)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*******************************************************************************\n") COMMA_SOURCE_FILE_AT_LINE (1315)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*           I N T E R R U P T    R O U T I N E    D U R A T I O N S           *\n") COMMA_SOURCE_FILE_AT_LINE (1316)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*******************************************************************************\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (1317)) ;
  const enumGalgasBool test_4 = GALGAS_bool (gOption_piccolo_5F_options_doNotComputeInterruptRoutineDuration.reader_value ()).boolEnum () ;
  if (kBoolTrue == test_4) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("option '").operator_concat (GALGAS_string (gOption_piccolo_5F_options_doNotComputeInterruptRoutineDuration.reader_string ()) COMMA_SOURCE_FILE_AT_LINE (1319)).operator_concat (GALGAS_string ("': interrupt routine durations are not computed.\n") COMMA_SOURCE_FILE_AT_LINE (1319)) COMMA_SOURCE_FILE_AT_LINE (1319)) ;
  }else if (kBoolFalse == test_4) {
    const enumGalgasBool test_5 = GALGAS_bool (gOption_piccolo_5F_options_doNotComputeStackRequirements.reader_value ()).boolEnum () ;
    if (kBoolTrue == test_5) {
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("option '").operator_concat (GALGAS_string (gOption_piccolo_5F_options_doNotComputeStackRequirements.reader_string ()) COMMA_SOURCE_FILE_AT_LINE (1321)).operator_concat (GALGAS_string ("': cannot compute interrupt routine durations.\n") COMMA_SOURCE_FILE_AT_LINE (1321)) COMMA_SOURCE_FILE_AT_LINE (1321)) ;
    }else if (kBoolFalse == test_5) {
      GALGAS_routineHasLoopMap var_routineHasLoopMap = GALGAS_routineHasLoopMap::constructor_emptyMap (SOURCE_FILE_AT_LINE (1323)) ;
      cEnumerator_routineDeclarationList enumerator_46874 (constinArgument_inUserRoutineDeclarationListForBootloaderImplementation, kEnumeration_up) ;
      while (enumerator_46874.hasCurrentObject ()) {
        {
        var_routineHasLoopMap.modifier_insertKey (enumerator_46874.current_mRoutineName (HERE), enumerator_46874.current_mIsNoReturn (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (1326)) ;
        }
        enumerator_46874.gotoNextObject () ;
      }
      cEnumerator_routineDeclarationList enumerator_47122 (constinArgument_inBootloaderRoutineDeclarationListForUserProgramImplementation, kEnumeration_up) ;
      while (enumerator_47122.hasCurrentObject ()) {
        {
        var_routineHasLoopMap.modifier_insertKey (enumerator_47122.current_mRoutineName (HERE), enumerator_47122.current_mIsNoReturn (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (1330)) ;
        }
        enumerator_47122.gotoNextObject () ;
      }
      cEnumerator_lstringlist enumerator_47342 (var_sortedRoutineNameList, kEnumeration_up) ;
      while (enumerator_47342.hasCurrentObject ()) {
        GALGAS_bool var_found = GALGAS_bool (false) ;
        cEnumerator_routineDefinitionList enumerator_47430 (constinArgument_inPiccoloModel.mAttribute_mRoutineDefinitionList, kEnumeration_up) ;
        bool bool_6 = var_found.operator_not (SOURCE_FILE_AT_LINE (1335)).isValidAndTrue () ;
        if (enumerator_47430.hasCurrentObject () && bool_6) {
          while (enumerator_47430.hasCurrentObject () && bool_6) {
            var_found = GALGAS_bool (kIsEqual, enumerator_47342.current_mValue (HERE).mAttribute_string.objectCompare (enumerator_47430.current_mRoutineName (HERE).mAttribute_string)) ;
            const enumGalgasBool test_7 = var_found.operator_and (var_routinesInvolvedInRecursion.reader_hasKey (enumerator_47430.current_mRoutineName (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (1337)).operator_not (SOURCE_FILE_AT_LINE (1337)) COMMA_SOURCE_FILE_AT_LINE (1337)).boolEnum () ;
            if (kBoolTrue == test_7) {
              GALGAS_bool var_hasLoopInstruction ;
              {
              routine_searchForLoopInInstructionList (enumerator_47430.current_mInstructionList (HERE), var_routineHasLoopMap, var_hasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (1338)) ;
              }
              {
              var_routineHasLoopMap.modifier_insertKey (enumerator_47430.current_mRoutineName (HERE), var_hasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (1339)) ;
              }
            }
            enumerator_47430.gotoNextObject () ;
            if (enumerator_47430.hasCurrentObject ()) {
              bool_6 = var_found.operator_not (SOURCE_FILE_AT_LINE (1335)).isValidAndTrue () ;
            }
          }
        }
        enumerator_47342.gotoNextObject () ;
      }
      cEnumerator_interruptDefinitionList enumerator_47948 (constinArgument_inPiccoloModel.mAttribute_mInterruptDefinitionList, kEnumeration_up) ;
      while (enumerator_47948.hasCurrentObject ()) {
        GALGAS_lstring var_routineName = GALGAS_lstring::constructor_new (GALGAS_string ("_").operator_concat (enumerator_47948.current_mInterruptName (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (1345)).operator_concat (GALGAS_string ("_interrupt_routine") COMMA_SOURCE_FILE_AT_LINE (1345)), enumerator_47948.current_mInterruptName (HERE).mAttribute_location COMMA_SOURCE_FILE_AT_LINE (1345)) ;
        const enumGalgasBool test_8 = var_routinesInvolvedInRecursion.reader_hasKey (var_routineName.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (1346)).boolEnum () ;
        if (kBoolTrue == test_8) {
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Cannot compute '").operator_concat (enumerator_47948.current_mInterruptName (HERE).reader_string (SOURCE_FILE_AT_LINE (1347)) COMMA_SOURCE_FILE_AT_LINE (1347)).operator_concat (GALGAS_string ("' interrupt routine duration : it is involved in recursive routine calls.\n") COMMA_SOURCE_FILE_AT_LINE (1347)) COMMA_SOURCE_FILE_AT_LINE (1347)) ;
        }else if (kBoolFalse == test_8) {
          GALGAS_bool var_hasLoopInstruction ;
          {
          routine_searchForLoopInInstructionList (enumerator_47948.current_mInstructionList (HERE), var_routineHasLoopMap, var_hasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (1349)) ;
          }
          {
          var_routineHasLoopMap.modifier_insertKey (var_routineName, var_hasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (1350)) ;
          }
          const enumGalgasBool test_9 = var_hasLoopInstruction.boolEnum () ;
          if (kBoolTrue == test_9) {
            ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Cannot compute '").operator_concat (enumerator_47948.current_mInterruptName (HERE).reader_string (SOURCE_FILE_AT_LINE (1352)) COMMA_SOURCE_FILE_AT_LINE (1352)).operator_concat (GALGAS_string ("' interrupt routine duration : it contains 'do ... while' instruction(s).\n") COMMA_SOURCE_FILE_AT_LINE (1352)) COMMA_SOURCE_FILE_AT_LINE (1352)) ;
            GALGAS_location location_10 (enumerator_47948.current_mInterruptName (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
            inCompiler->emitSemanticWarning (location_10, GALGAS_string ("cannot compute '").operator_concat (enumerator_47948.current_mInterruptName (HERE).reader_string (SOURCE_FILE_AT_LINE (1353)) COMMA_SOURCE_FILE_AT_LINE (1353)).operator_concat (GALGAS_string ("' interrupt routine duration : it contains 'do ... while' instruction's).\n") COMMA_SOURCE_FILE_AT_LINE (1353)) COMMA_SOURCE_FILE_AT_LINE (1353)) ;
          }
        }
        enumerator_47948.gotoNextObject () ;
      }
      GALGAS_symbolTableForOptimizations var_symbolTable = GALGAS_symbolTableForOptimizations::constructor_emptyMap (SOURCE_FILE_AT_LINE (1358)) ;
      cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_49021 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
      GALGAS_uint index_49015 ((PMUInt32) 0) ;
      while (enumerator_49021.hasCurrentObject ()) {
        callCategoryMethod_defineLabel ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_49021.current_mInstruction (HERE).ptr (), var_symbolTable, index_49015, inCompiler COMMA_SOURCE_FILE_AT_LINE (1360)) ;
        enumerator_49021.gotoNextObject () ;
        index_49015.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1359)) ;
      }
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n"
        "Durations are expressed in instruction clock cycles.\n"
        "\n") COMMA_SOURCE_FILE_AT_LINE (1362)) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Routine").reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 70U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (1363)).operator_concat (GALGAS_string (" Min-Max\n") COMMA_SOURCE_FILE_AT_LINE (1363)) COMMA_SOURCE_FILE_AT_LINE (1363)) ;
      GALGAS_routineMinMaxMap var_routineMinMaxMap = GALGAS_routineMinMaxMap::constructor_emptyMap (SOURCE_FILE_AT_LINE (1364)) ;
      cEnumerator_lstringlist enumerator_49374 (var_sortedRoutineNameList, kEnumeration_up) ;
      while (enumerator_49374.hasCurrentObject ()) {
        const enumGalgasBool test_11 = var_symbolTable.reader_hasKey (enumerator_49374.current_mValue (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (1366)).operator_and (var_routineHasLoopMap.reader_hasKey (enumerator_49374.current_mValue (HERE).mAttribute_string COMMA_SOURCE_FILE_AT_LINE (1366)) COMMA_SOURCE_FILE_AT_LINE (1366)).boolEnum () ;
        if (kBoolTrue == test_11) {
          GALGAS_bool var_hasLoopInstruction ;
          var_routineHasLoopMap.method_searchKey (enumerator_49374.current_mValue (HERE), var_hasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (1367)) ;
          const enumGalgasBool test_12 = var_hasLoopInstruction.boolEnum () ;
          if (kBoolTrue == test_12) {
            ioArgument_ioListFileContents.dotAssign_operation (enumerator_49374.current_mValue (HERE).mAttribute_string.reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 70U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (1369)).operator_concat (GALGAS_string (" loops\n") COMMA_SOURCE_FILE_AT_LINE (1369)) COMMA_SOURCE_FILE_AT_LINE (1369)) ;
          }else if (kBoolFalse == test_12) {
            GALGAS_uintlist var_minArray = GALGAS_uintlist::constructor_emptyList (SOURCE_FILE_AT_LINE (1371)) ;
            GALGAS_uintlist var_maxArray = GALGAS_uintlist::constructor_emptyList (SOURCE_FILE_AT_LINE (1372)) ;
            cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_49811 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
            while (enumerator_49811.hasCurrentObject ()) {
              var_minArray.addAssign_operation (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (1374)) COMMA_SOURCE_FILE_AT_LINE (1374)) ;
              var_maxArray.addAssign_operation (GALGAS_uint ((PMUInt32) 0U) COMMA_SOURCE_FILE_AT_LINE (1375)) ;
              enumerator_49811.gotoNextObject () ;
            }
            GALGAS_uint var_executionMin = GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (1377)) ;
            GALGAS_uint var_executionMax = GALGAS_uint ((PMUInt32) 0U) ;
            const enumGalgasBool test_13 = GALGAS_bool (gOption_galgas_5F_builtin_5F_options_verbose_5F_output.reader_value ()).boolEnum () ;
            if (kBoolTrue == test_13) {
              ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" ").operator_concat (enumerator_49374.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (1380)) COMMA_SOURCE_FILE_AT_LINE (1380)).reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 76U), GALGAS_char (TO_UNICODE (45)) COMMA_SOURCE_FILE_AT_LINE (1380)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (1380)) COMMA_SOURCE_FILE_AT_LINE (1380)) ;
              ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" Line:  min-  max:\n") COMMA_SOURCE_FILE_AT_LINE (1381)) ;
            }
            {
            routine_computeMinMaxFromLabel (enumerator_49374.current_mValue (HERE), var_symbolTable, var_routineMinMaxMap, constinArgument_inGeneratedInstructionList, var_minArray, GALGAS_uint ((PMUInt32) 0U), var_executionMin, var_maxArray, GALGAS_uint ((PMUInt32) 0U), var_executionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1383)) ;
            }
            {
            var_routineMinMaxMap.modifier_insertKey (enumerator_49374.current_mValue (HERE), var_executionMin, var_executionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1391)) ;
            }
            cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_50593 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
            GALGAS_uint index_50587 ((PMUInt32) 0) ;
            while (enumerator_50593.hasCurrentObject ()) {
              GALGAS_uint var_imin = var_minArray.reader_mValueAtIndex (index_50587, inCompiler COMMA_SOURCE_FILE_AT_LINE (1393)) ;
              GALGAS_uint var_imax = var_maxArray.reader_mValueAtIndex (index_50587, inCompiler COMMA_SOURCE_FILE_AT_LINE (1394)) ;
              const enumGalgasBool test_14 = GALGAS_bool (kIsInfOrEqual, var_imin.objectCompare (var_imax)).operator_and (GALGAS_bool (gOption_galgas_5F_builtin_5F_options_verbose_5F_output.reader_value ()) COMMA_SOURCE_FILE_AT_LINE (1395)).boolEnum () ;
              if (kBoolTrue == test_14) {
                ioArgument_ioListFileContents.dotAssign_operation (index_50587.reader_string (SOURCE_FILE_AT_LINE (1396)).reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 5U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (1396)).operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (1396)) COMMA_SOURCE_FILE_AT_LINE (1396)) ;
                ioArgument_ioListFileContents.dotAssign_operation (var_imin.reader_string (SOURCE_FILE_AT_LINE (1397)).reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 5U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (1397)).operator_concat (GALGAS_string ("-") COMMA_SOURCE_FILE_AT_LINE (1397)) COMMA_SOURCE_FILE_AT_LINE (1397)) ;
                ioArgument_ioListFileContents.dotAssign_operation (var_imax.reader_string (SOURCE_FILE_AT_LINE (1398)).reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 5U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (1398)).operator_concat (GALGAS_string (":") COMMA_SOURCE_FILE_AT_LINE (1398)) COMMA_SOURCE_FILE_AT_LINE (1398)) ;
                callCategoryMethod_display ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_50593.current_mInstruction (HERE).ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1399)) ;
                ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (1400)) ;
              }
              enumerator_50593.gotoNextObject () ;
              index_50587.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1392)) ;
            }
            const enumGalgasBool test_15 = GALGAS_bool (gOption_galgas_5F_builtin_5F_options_verbose_5F_output.reader_value ()).boolEnum () ;
            if (kBoolTrue == test_15) {
