pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
              ioArgument_ioListFileContents.dotAssign_operation (enumerator_49374.current_mValue (HERE).mAttribute_string.operator_concat (GALGAS_string (" --> ") COMMA_SOURCE_FILE_AT_LINE (1404)).operator_concat (var_executionMin.reader_string (SOURCE_FILE_AT_LINE (1404)) COMMA_SOURCE_FILE_AT_LINE (1404)).operator_concat (GALGAS_string (" ... ") COMMA_SOURCE_FILE_AT_LINE (1404)).operator_concat (var_executionMax.reader_string (SOURCE_FILE_AT_LINE (1404)) COMMA_SOURCE_FILE_AT_LINE (1404)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (1404)) COMMA_SOURCE_FILE_AT_LINE (1404)) ;
            }else if (kBoolFalse == test_15) {
              ioArgument_ioListFileContents.dotAssign_operation (enumerator_49374.current_mValue (HERE).mAttribute_string.reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 70U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (1406)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (1406)).operator_concat (var_executionMin.reader_string (SOURCE_FILE_AT_LINE (1406)) COMMA_SOURCE_FILE_AT_LINE (1406)).operator_concat (GALGAS_string ("-") COMMA_SOURCE_FILE_AT_LINE (1406)).operator_concat (var_executionMax.reader_string (SOURCE_FILE_AT_LINE (1406)) COMMA_SOURCE_FILE_AT_LINE (1406)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (1406)) COMMA_SOURCE_FILE_AT_LINE (1406)) ;
            }
          }
        }else if (kBoolFalse == test_11) {
          ioArgument_ioListFileContents.dotAssign_operation (enumerator_49374.current_mValue (HERE).mAttribute_string.reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 70U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (1410)).operator_concat (GALGAS_string (" recursive\n") COMMA_SOURCE_FILE_AT_LINE (1410)) COMMA_SOURCE_FILE_AT_LINE (1410)) ;
        }
        enumerator_49374.gotoNextObject () ;
      }
    }
  }
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (1414)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//          Category method '@piccolo_instruction enterCallInGraph'          *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_piccolo_5F_instruction_enterCallInGraph> gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterCallInGraph (const PMSInt32 inClassIndex,
                                           categoryMethodSignature_piccolo_5F_instruction_enterCallInGraph inMethod) {
  gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                          GALGAS_lstring in_inRoutineName,
                                          GALGAS_routineCallGraph & io_ioRoutineCallGraph,
                                          C_Compiler * inCompiler
                                          COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_piccolo_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_piccolo_5F_instruction_enterCallInGraph f = NULL ;
    if (classIndex < gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph.count ()) {
      f = gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph.count ()) {
           f = gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, in_inRoutineName, io_ioRoutineCallGraph, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_piccolo_5F_instruction_enterCallInGraph (const cPtr_piccolo_5F_instruction * /* inObject */,
                                                                    GALGAS_lstring /* inArgument_inRoutineName */,
                                                                    GALGAS_routineCallGraph & /* ioArgument_ioRoutineCallGraph */,
                                                                    C_Compiler * /* inCompiler */
                                                                    COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_piccolo_5F_instruction_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_piccolo_5F_instruction.mSlotID,
                                        categoryMethod_piccolo_5F_instruction_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_piccolo_5F_instruction_enterCallInGraph (void) {
  gCategoryMethodTable_piccolo_5F_instruction_enterCallInGraph.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_piccolo_5F_instruction_enterCallInGraph (defineCategoryMethod_piccolo_5F_instruction_enterCallInGraph,
                                                                    freeCategoryMethod_piccolo_5F_instruction_enterCallInGraph) ;

//---------------------------------------------------------------------------*
//                                                                           *
//      Overriding category method '@instruction_JSR enterCallInGraph'       *
//                                                                           *
//---------------------------------------------------------------------------*

