pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void categoryMethod_instruction_5F_JSR_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                                                GALGAS_lstring inArgument_inRoutineName,
                                                                GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                                                C_Compiler * /* inCompiler */
                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_JSR * object = (const cPtr_instruction_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_JSR) ;
  {
  ioArgument_ioRoutineCallGraph.modifier_addArc (inArgument_inRoutineName, object->mAttribute_mTargetLabel COMMA_SOURCE_FILE_AT_LINE (31)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_JSR_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_instruction_5F_JSR.mSlotID,
                                        categoryMethod_instruction_5F_JSR_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_JSR_enterCallInGraph (defineCategoryMethod_instruction_5F_JSR_enterCallInGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_computed_rcall enterCallInGraph' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_rcall_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                                                              GALGAS_lstring inArgument_inRoutineName,
                                                                              GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                                                              C_Compiler * /* inCompiler */
                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_rcall * object = (const cPtr_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_rcall) ;
  cEnumerator_lstringlist enumerator_1468 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_1468.hasCurrentObject ()) {
    {
    ioArgument_ioRoutineCallGraph.modifier_addArc (inArgument_inRoutineName, enumerator_1468.current_mValue (HERE) COMMA_SOURCE_FILE_AT_LINE (41)) ;
    }
    enumerator_1468.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_computed_5F_rcall_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_rcall.mSlotID,
                                        categoryMethod_instruction_5F_computed_5F_rcall_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_computed_5F_rcall_enterCallInGraph (defineCategoryMethod_instruction_5F_computed_5F_rcall_enterCallInGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_computed_goto enterCallInGraph'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_goto_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                                                             GALGAS_lstring inArgument_inRoutineName,
                                                                             GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                                                             C_Compiler * /* inCompiler */
                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_goto * object = (const cPtr_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_goto) ;
  cEnumerator_lstringlist enumerator_1792 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_1792.hasCurrentObject ()) {
    {
    ioArgument_ioRoutineCallGraph.modifier_addArc (inArgument_inRoutineName, enumerator_1792.current_mValue (HERE) COMMA_SOURCE_FILE_AT_LINE (52)) ;
    }
    enumerator_1792.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_computed_5F_goto_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_goto.mSlotID,
                                        categoryMethod_instruction_5F_computed_5F_goto_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_computed_5F_goto_enterCallInGraph (defineCategoryMethod_instruction_5F_computed_5F_goto_enterCallInGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Overriding category method '@instruction_FOREVER enterCallInGraph'     *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_FOREVER_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                                                    GALGAS_lstring inArgument_inRoutineName,
                                                                    GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                                                    C_Compiler * inCompiler
                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_FOREVER * object = (const cPtr_instruction_5F_FOREVER *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_FOREVER) ;
  {
  routine_exploreInstructionList (object->mAttribute_mInstructionList, inArgument_inRoutineName, ioArgument_ioRoutineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (62)) ;
  }
}
//---------------------------------------------------------------------------*

