pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void defineCategoryMethod_instruction_5F_FOREVER_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_instruction_5F_FOREVER.mSlotID,
                                        categoryMethod_instruction_5F_FOREVER_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_FOREVER_enterCallInGraph (defineCategoryMethod_instruction_5F_FOREVER_enterCallInGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_structured_if enterCallInGraph'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_structured_5F_if_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                                                             GALGAS_lstring inArgument_inRoutineName,
                                                                             GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                                                             C_Compiler * inCompiler
                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_structured_5F_if * object = (const cPtr_instruction_5F_structured_5F_if *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_structured_5F_if) ;
  {
  routine_exploreInstructionList (object->mAttribute_mThenInstructionList, inArgument_inRoutineName, ioArgument_ioRoutineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)) ;
  }
  {
  routine_exploreInstructionList (object->mAttribute_mElseInstructionList, inArgument_inRoutineName, ioArgument_ioRoutineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (72)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_structured_5F_if_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_instruction_5F_structured_5F_if.mSlotID,
                                        categoryMethod_instruction_5F_structured_5F_if_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_structured_5F_if_enterCallInGraph (defineCategoryMethod_instruction_5F_structured_5F_if_enterCallInGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Overriding category method '@instruction_do_while enterCallInGraph'    *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_do_5F_while_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                                                        GALGAS_lstring inArgument_inRoutineName,
                                                                        GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_do_5F_while * object = (const cPtr_instruction_5F_do_5F_while *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_do_5F_while) ;
  {
  routine_exploreInstructionList (object->mAttribute_mRepeatedInstructionList, inArgument_inRoutineName, ioArgument_ioRoutineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (81)) ;
  }
  cEnumerator_partList enumerator_2890 (object->mAttribute_mWhilePartList, kEnumeration_up) ;
  while (enumerator_2890.hasCurrentObject ()) {
    {
    routine_exploreInstructionList (enumerator_2890.current_mInstructionList (HERE), inArgument_inRoutineName, ioArgument_ioRoutineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (83)) ;
    }
    enumerator_2890.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_do_5F_while_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_instruction_5F_do_5F_while.mSlotID,
                                        categoryMethod_instruction_5F_do_5F_while_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_do_5F_while_enterCallInGraph (defineCategoryMethod_instruction_5F_do_5F_while_enterCallInGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_IF_SEMI_COLON enterCallInGraph'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_IF_5F_SEMI_5F_COLON_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                                                                GALGAS_lstring inArgument_inRoutineName,
                                                                                GALGAS_routineCallGraph & ioArgument_ioRoutineCallGraph,
                                                                                C_Compiler * inCompiler
                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_IF_5F_SEMI_5F_COLON * object = (const cPtr_instruction_5F_IF_5F_SEMI_5F_COLON *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_IF_5F_SEMI_5F_COLON) ;
  callCategoryMethod_enterCallInGraph ((const cPtr_piccolo_5F_instruction *) object->mAttribute_mInstruction.ptr (), inArgument_inRoutineName, ioArgument_ioRoutineCallGraph, inCompiler COMMA_SOURCE_FILE_AT_LINE (93)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_IF_5F_SEMI_5F_COLON_enterCallInGraph (void) {
  enterCategoryMethod_enterCallInGraph (kTypeDescriptor_GALGAS_instruction_5F_IF_5F_SEMI_5F_COLON.mSlotID,
                                        categoryMethod_instruction_5F_IF_5F_SEMI_5F_COLON_enterCallInGraph) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_IF_5F_SEMI_5F_COLON_enterCallInGraph (defineCategoryMethod_instruction_5F_IF_5F_SEMI_5F_COLON_enterCallInGraph, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Category method '@pic18_intermediate_instruction exploreStackNeeds'    *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_exploreStackNeeds (const PMSInt32 inClassIndex,
                                            categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

