pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
void callCategoryMethod_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                           const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constin_inGeneratedInstructionList,
                                           const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                           const GALGAS_symbolTableForStackLevels constin_inSymbolTableForStackLevels,
                                           const GALGAS_uint constin_inCurrentLine,
                                           GALGAS_uintlist & io_ioStackNeedsArray,
                                           GALGAS_stringset & io_ioExploredLineSet,
                                           GALGAS_string & io_ioListFileContents,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inGeneratedInstructionList, constin_inSymbolTable, constin_inSymbolTableForStackLevels, constin_inCurrentLine, io_ioStackNeedsArray, io_ioExploredLineSet, io_ioListFileContents, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                         const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                         const GALGAS_symbolTableForStackLevels /* constinArgument_inSymbolTableForStackLevels */,
                                                                                         const GALGAS_uint constinArgument_inCurrentLine,
                                                                                         GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                         GALGAS_stringset & /* ioArgument_ioExploredLineSet */,
                                                                                         GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (GALGAS_uint ((PMUInt32) 0U), constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (131)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds,
                                                                                         freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18_intermediate_JSR exploreStackNeeds'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                 const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                 const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                 const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                 const GALGAS_uint constinArgument_inCurrentLine,
                                                                                 GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                 GALGAS_stringset & /* ioArgument_ioExploredLineSet */,
                                                                                 GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                 C_Compiler * inCompiler
                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  GALGAS_uint var_stackNeeds ;
  constinArgument_inSymbolTableForStackLevels.method_searchKey (object->mAttribute_mTargetLabel, var_stackNeeds, inCompiler COMMA_SOURCE_FILE_AT_LINE (145)) ;
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_stackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (146)) ;
  }
}
//---------------------------------------------------------------------------*

