pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_JSR_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_retlw exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                              const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                                              const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                                              const GALGAS_symbolTableForStackLevels /* constinArgument_inSymbolTableForStackLevels */,
                                                                                                              const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                              GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                              GALGAS_stringset & /* ioArgument_ioExploredLineSet */,
                                                                                                              GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                                              C_Compiler * inCompiler
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (GALGAS_uint ((PMUInt32) 1U), constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (160)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18_intermediate_JUMP exploreStackNeeds'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                  const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                  const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                  const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                  const GALGAS_uint constinArgument_inCurrentLine,
                                                                                  GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                  GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                  GALGAS_string & ioArgument_ioListFileContents,
                                                                                  C_Compiler * inCompiler
                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  GALGAS_uint var_instructionStackNeeds ;
  {
  routine_computeStackLevelsFromLabel (constinArgument_inGeneratedInstructionList, object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, var_instructionStackNeeds, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (174)) ;
  }
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_instructionStackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (184)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_bra exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

