pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                            const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                            const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                            const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                            GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                            GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                                            GALGAS_string & ioArgument_ioListFileContents,
                                                                                                            C_Compiler * inCompiler
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  GALGAS_uint var_stackNeeds = GALGAS_uint ((PMUInt32) 1U) ;
  cEnumerator_lstringlist enumerator_7263 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_7263.hasCurrentObject ()) {
    GALGAS_uint var_instStackNeeds ;
    {
    routine_computeStackLevelsFromLabel (constinArgument_inGeneratedInstructionList, enumerator_7263.current_mValue (HERE), constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, var_instStackNeeds, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (200)) ;
    }
    const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_stackNeeds.objectCompare (var_instStackNeeds)).boolEnum () ;
    if (kBoolTrue == test_0) {
      var_stackNeeds = var_instStackNeeds ;
    }
    enumerator_7263.gotoNextObject () ;
  }
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_stackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (214)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_incDecRegisterInCondition exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                       const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                       const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                       const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                       const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                       GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                       GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                                                       C_Compiler * inCompiler
                                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  GALGAS_uint var_instructionStackNeeds ;
  {
  routine_computeStackLevelsFromLabel (constinArgument_inGeneratedInstructionList, object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, var_instructionStackNeeds, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (228)) ;
  }
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_instructionStackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (238)) ;
  }
}
//---------------------------------------------------------------------------*

