pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_jump_test_register exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                      const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                      const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                      const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                      const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                      GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                      GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                                                      C_Compiler * inCompiler
                                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (GALGAS_uint ((PMUInt32) 0U), constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (253)) ;
  }
  {
  routine_computeStackLevelsFromLine (constinArgument_inGeneratedInstructionList, constinArgument_inCurrentLine.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (257)), constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (255)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_registerComparisonCondition exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                         const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                         const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                         const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                         GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                         GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                                         GALGAS_string & ioArgument_ioListFileContents,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  GALGAS_uint var_instructionStackNeeds ;
  {
  routine_computeStackLevelsFromLabel (constinArgument_inGeneratedInstructionList, object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, var_instructionStackNeeds, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (277)) ;
  }
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_instructionStackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (287)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_BitTestSkip exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

