pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                        const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                        const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                        const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                        GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                        GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  {
  routine_computeStackLevelsFromLine (constinArgument_inGeneratedInstructionList, constinArgument_inCurrentLine.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (303)), constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (301)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_goto exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                             const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                             const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                             const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                             const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                             GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                             GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                                             GALGAS_string & ioArgument_ioListFileContents,
                                                                                                             C_Compiler * inCompiler
                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  GALGAS_uint var_stackNeeds = GALGAS_uint ((PMUInt32) 1U) ;
  cEnumerator_lstringlist enumerator_11293 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_11293.hasCurrentObject ()) {
    GALGAS_uint var_instructionStackNeeds ;
    {
    routine_computeStackLevelsFromLabel (constinArgument_inGeneratedInstructionList, enumerator_11293.current_mValue (HERE), constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, var_instructionStackNeeds, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (325)) ;
    }
    const enumGalgasBool test_0 = GALGAS_bool (kIsStrictInf, var_stackNeeds.objectCompare (var_instructionStackNeeds)).boolEnum () ;
    if (kBoolTrue == test_0) {
      var_stackNeeds = var_instructionStackNeeds ;
    }
    enumerator_11293.gotoNextObject () ;
  }
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_stackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (339)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_rcall exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

