pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                              const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                                              const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                                              const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                              const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                              GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                              GALGAS_stringset & /* ioArgument_ioExploredLineSet */,
                                                                                                              GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                                              C_Compiler * inCompiler
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  GALGAS_uint var_maxStackNeeds = GALGAS_uint ((PMUInt32) 1U) ;
  cEnumerator_lstringlist enumerator_12293 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_12293.hasCurrentObject ()) {
    GALGAS_uint var_stackNeeds ;
    constinArgument_inSymbolTableForStackLevels.method_searchKey (enumerator_12293.current_mValue (HERE), var_stackNeeds, inCompiler COMMA_SOURCE_FILE_AT_LINE (355)) ;
    const enumGalgasBool test_0 = GALGAS_bool (kIsStrictInf, var_maxStackNeeds.objectCompare (var_stackNeeds)).boolEnum () ;
    if (kBoolTrue == test_0) {
      var_maxStackNeeds = var_stackNeeds ;
    }
    enumerator_12293.gotoNextObject () ;
  }
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_maxStackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (360)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_conditionalBranch exploreStackNeeds'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                              const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                              const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                              const GALGAS_symbolTableForStackLevels constinArgument_inSymbolTableForStackLevels,
                                                                                                              const GALGAS_uint constinArgument_inCurrentLine,
                                                                                                              GALGAS_uintlist & ioArgument_ioStackNeedsArray,
                                                                                                              GALGAS_stringset & ioArgument_ioExploredLineSet,
                                                                                                              GALGAS_string & ioArgument_ioListFileContents,
                                                                                                              C_Compiler * inCompiler
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  GALGAS_uint var_instructionStackNeeds ;
  {
  routine_computeStackLevelsFromLabel (constinArgument_inGeneratedInstructionList, object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inSymbolTableForStackLevels, ioArgument_ioStackNeedsArray, var_instructionStackNeeds, ioArgument_ioExploredLineSet, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (374)) ;
  }
  {
  ioArgument_ioStackNeedsArray.modifier_setMValueAtIndex (var_instructionStackNeeds, constinArgument_inCurrentLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (384)) ;
  }
}
//---------------------------------------------------------------------------*

