pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_exploreStackNeeds (void) {
  enterCategoryMethod_exploreStackNeeds (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                         categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_exploreStackNeeds) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_exploreStackNeeds (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_exploreStackNeeds, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//      Category method '@piccolo_instruction searchForLoopInstruction'      *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_piccolo_5F_instruction_searchForLoopInstruction> gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_searchForLoopInstruction (const PMSInt32 inClassIndex,
                                                   categoryMethodSignature_piccolo_5F_instruction_searchForLoopInstruction inMethod) {
  gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                  const GALGAS_routineHasLoopMap constin_inRoutineHasLoopMap,
                                                  GALGAS_bool & out_outHasLoopInstruction,
                                                  C_Compiler * inCompiler
                                                  COMMA_LOCATION_ARGS) {
  out_outHasLoopInstruction.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_piccolo_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_piccolo_5F_instruction_searchForLoopInstruction f = NULL ;
    if (classIndex < gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction.count ()) {
      f = gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction.count ()) {
           f = gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inRoutineHasLoopMap, out_outHasLoopInstruction, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_piccolo_5F_instruction_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * /* inObject */,
                                                                            const GALGAS_routineHasLoopMap /* constinArgument_inRoutineHasLoopMap */,
                                                                            GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                            C_Compiler * /* inCompiler */
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outHasLoopInstruction = GALGAS_bool (false) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_piccolo_5F_instruction_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_piccolo_5F_instruction.mSlotID,
                                                categoryMethod_piccolo_5F_instruction_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_piccolo_5F_instruction_searchForLoopInstruction (void) {
  gCategoryMethodTable_piccolo_5F_instruction_searchForLoopInstruction.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_piccolo_5F_instruction_searchForLoopInstruction (defineCategoryMethod_piccolo_5F_instruction_searchForLoopInstruction,
                                                                            freeCategoryMethod_piccolo_5F_instruction_searchForLoopInstruction) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_do_while searchForLoopInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_do_5F_while_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * /* inObject */,
                                                                                const GALGAS_routineHasLoopMap /* constinArgument_inRoutineHasLoopMap */,
                                                                                GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                                C_Compiler * /* inCompiler */
                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outHasLoopInstruction = GALGAS_bool (true) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_do_5F_while_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_do_5F_while.mSlotID,
                                                categoryMethod_instruction_5F_do_5F_while_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

