pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
C_PrologueEpilogue gMethod_instruction_5F_do_5F_while_searchForLoopInstruction (defineCategoryMethod_instruction_5F_do_5F_while_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_FOREVER searchForLoopInstruction' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_FOREVER_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * /* inObject */,
                                                                            const GALGAS_routineHasLoopMap /* constinArgument_inRoutineHasLoopMap */,
                                                                            GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                            C_Compiler * /* inCompiler */
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outHasLoopInstruction = GALGAS_bool (true) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_FOREVER_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_FOREVER.mSlotID,
                                                categoryMethod_instruction_5F_FOREVER_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_FOREVER_searchForLoopInstruction (defineCategoryMethod_instruction_5F_FOREVER_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_JUMP searchForLoopInstruction'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_JUMP_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                                         const GALGAS_routineHasLoopMap constinArgument_inRoutineHasLoopMap,
                                                                         GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                         C_Compiler * inCompiler
                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_JUMP * object = (const cPtr_instruction_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_JUMP) ;
  constinArgument_inRoutineHasLoopMap.method_searchKey (object->mAttribute_mTargetLabel, outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (563)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_JUMP_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_JUMP.mSlotID,
                                                categoryMethod_instruction_5F_JUMP_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_JUMP_searchForLoopInstruction (defineCategoryMethod_instruction_5F_JUMP_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_JSR searchForLoopInstruction'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_JSR_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                                        const GALGAS_routineHasLoopMap constinArgument_inRoutineHasLoopMap,
                                                                        GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_JSR * object = (const cPtr_instruction_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_JSR) ;
  constinArgument_inRoutineHasLoopMap.method_searchKey (object->mAttribute_mTargetLabel, outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (572)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_JSR_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_JSR.mSlotID,
                                                categoryMethod_instruction_5F_JSR_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_JSR_searchForLoopInstruction (defineCategoryMethod_instruction_5F_JSR_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_structured_if searchForLoopInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_structured_5F_if_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                                                     const GALGAS_routineHasLoopMap constinArgument_inRoutineHasLoopMap,
                                                                                     GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_structured_5F_if * object = (const cPtr_instruction_5F_structured_5F_if *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_structured_5F_if) ;
  {
  routine_searchForLoopInInstructionList (object->mAttribute_mThenInstructionList, constinArgument_inRoutineHasLoopMap, outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (581)) ;
  }
  const enumGalgasBool test_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (582)).boolEnum () ;
  if (kBoolTrue == test_0) {
    {
    routine_searchForLoopInInstructionList (object->mAttribute_mElseInstructionList, constinArgument_inRoutineHasLoopMap, outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (583)) ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_structured_5F_if_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_structured_5F_if.mSlotID,
                                                categoryMethod_instruction_5F_structured_5F_if_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

