pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
C_PrologueEpilogue gMethod_instruction_5F_structured_5F_if_searchForLoopInstruction (defineCategoryMethod_instruction_5F_structured_5F_if_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_computed_bra searchForLoopInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_bra_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                                                    const GALGAS_routineHasLoopMap constinArgument_inRoutineHasLoopMap,
                                                                                    GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                                    C_Compiler * inCompiler
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_bra * object = (const cPtr_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_bra) ;
  outArgument_outHasLoopInstruction = GALGAS_bool (false) ;
  cEnumerator_lstringlist enumerator_21047 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  bool bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (594)).isValidAndTrue () ;
  if (enumerator_21047.hasCurrentObject () && bool_0) {
    while (enumerator_21047.hasCurrentObject () && bool_0) {
      constinArgument_inRoutineHasLoopMap.method_searchKey (enumerator_21047.current_mValue (HERE), outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (595)) ;
      enumerator_21047.gotoNextObject () ;
      if (enumerator_21047.hasCurrentObject ()) {
        bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (594)).isValidAndTrue () ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_computed_5F_bra_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_bra.mSlotID,
                                                categoryMethod_instruction_5F_computed_5F_bra_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_computed_5F_bra_searchForLoopInstruction (defineCategoryMethod_instruction_5F_computed_5F_bra_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_computed_goto searchForLoopInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_goto_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                                                     const GALGAS_routineHasLoopMap constinArgument_inRoutineHasLoopMap,
                                                                                     GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_goto * object = (const cPtr_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_goto) ;
  outArgument_outHasLoopInstruction = GALGAS_bool (false) ;
  cEnumerator_lstringlist enumerator_21464 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  bool bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (606)).isValidAndTrue () ;
  if (enumerator_21464.hasCurrentObject () && bool_0) {
    while (enumerator_21464.hasCurrentObject () && bool_0) {
      constinArgument_inRoutineHasLoopMap.method_searchKey (enumerator_21464.current_mValue (HERE), outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (607)) ;
      enumerator_21464.gotoNextObject () ;
      if (enumerator_21464.hasCurrentObject ()) {
        bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (606)).isValidAndTrue () ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_computed_5F_goto_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_goto.mSlotID,
                                                categoryMethod_instruction_5F_computed_5F_goto_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_computed_5F_goto_searchForLoopInstruction (defineCategoryMethod_instruction_5F_computed_5F_goto_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_computed_rcall searchForLoopInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_rcall_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                                                      const GALGAS_routineHasLoopMap constinArgument_inRoutineHasLoopMap,
                                                                                      GALGAS_bool & outArgument_outHasLoopInstruction,
                                                                                      C_Compiler * inCompiler
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_rcall * object = (const cPtr_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_rcall) ;
  outArgument_outHasLoopInstruction = GALGAS_bool (false) ;
  cEnumerator_lstringlist enumerator_21882 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  bool bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (618)).isValidAndTrue () ;
  if (enumerator_21882.hasCurrentObject () && bool_0) {
    while (enumerator_21882.hasCurrentObject () && bool_0) {
      constinArgument_inRoutineHasLoopMap.method_searchKey (enumerator_21882.current_mValue (HERE), outArgument_outHasLoopInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (619)) ;
      enumerator_21882.gotoNextObject () ;
      if (enumerator_21882.hasCurrentObject ()) {
        bool_0 = outArgument_outHasLoopInstruction.operator_not (SOURCE_FILE_AT_LINE (618)).isValidAndTrue () ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_computed_5F_rcall_searchForLoopInstruction (void) {
  enterCategoryMethod_searchForLoopInstruction (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_rcall.mSlotID,
                                                categoryMethod_instruction_5F_computed_5F_rcall_searchForLoopInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_computed_5F_rcall_searchForLoopInstruction (defineCategoryMethod_instruction_5F_computed_5F_rcall_searchForLoopInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//        Category method '@pic18_intermediate_instruction duration'         *
//                                                                           *
//---------------------------------------------------------------------------*

