pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_duration> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_duration (const PMSInt32 inClassIndex,
                                   categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_duration inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                  const GALGAS_uint constin_inCurrentLine,
                                  const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                  const GALGAS_routineMinMaxMap constin_inRoutineMinMaxMap,
                                  const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constin_inGeneratedInstructionList,
                                  GALGAS_uintlist & io_ioMinArray,
                                  GALGAS_uintlist & io_ioMaxArray,
                                  GALGAS_uint & io_ioCurrentMin,
                                  GALGAS_uint & io_ioCurrentMax,
                                  GALGAS_uint & io_ioExecutionMin,
                                  GALGAS_uint & io_ioExecutionMax,
                                  C_Compiler * inCompiler
                                  COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_duration f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inCurrentLine, constin_inSymbolTable, constin_inRoutineMinMaxMap, constin_inGeneratedInstructionList, io_ioMinArray, io_ioMaxArray, io_ioCurrentMin, io_ioCurrentMax, io_ioExecutionMin, io_ioExecutionMax, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                GALGAS_uint & /* ioArgument_ioCurrentMin */,
                                                                                GALGAS_uint & /* ioArgument_ioCurrentMax */,
                                                                                GALGAS_uint & /* ioArgument_ioExecutionMin */,
                                                                                GALGAS_uint & /* ioArgument_ioExecutionMax */,
                                                                                C_Compiler * /* inCompiler */
                                                                                COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_duration) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_duration (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_duration.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_duration,
                                                                                freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_duration) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_actualInstruction duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                      const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                      const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                      const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                      const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                      GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                      GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                      GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                      GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                      GALGAS_uint & /* ioArgument_ioExecutionMin */,
                                                                                      GALGAS_uint & /* ioArgument_ioExecutionMax */,
                                                                                      C_Compiler * inCompiler
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (670)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (671)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_duration) ;
}

//---------------------------------------------------------------------------*

