pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_actualInstruction_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MOVFF duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                         const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                         const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                         const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                         GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                         GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                         GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                         GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                         GALGAS_uint & /* ioArgument_ioExecutionMin */,
                                                                                         GALGAS_uint & /* ioArgument_ioExecutionMax */,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (688)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (689)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@pic18_intermediate_JSR duration'       *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                        const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                        const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                        const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                        GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                        GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                        GALGAS_uint & ioArgument_ioCurrentMin,
                                                                        GALGAS_uint & ioArgument_ioCurrentMax,
                                                                        GALGAS_uint & /* ioArgument_ioExecutionMin */,
                                                                        GALGAS_uint & /* ioArgument_ioExecutionMax */,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  GALGAS_uint var_min ;
  GALGAS_uint var_max ;
  constinArgument_inRoutineMinMaxMap.method_searchKey (object->mAttribute_mTargetLabel, var_min, var_max, inCompiler COMMA_SOURCE_FILE_AT_LINE (706)) ;
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (707)).add_operation (var_min, inCompiler COMMA_SOURCE_FILE_AT_LINE (707)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (708)).add_operation (var_max, inCompiler COMMA_SOURCE_FILE_AT_LINE (708)) ;
}
//---------------------------------------------------------------------------*

