pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_JSR_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_LFSR duration' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                        const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                        const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                        const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                        GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                        GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                        GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                        GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                        GALGAS_uint & /* ioArgument_ioExecutionMin */,
                                                                                        GALGAS_uint & /* ioArgument_ioExecutionMax */,
                                                                                        C_Compiler * inCompiler
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (725)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (726)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MNOP duration' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                        const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                        const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                        const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                        GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                        GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                        GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                        GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                        GALGAS_uint & /* ioArgument_ioExecutionMin */,
                                                                                        GALGAS_uint & /* ioArgument_ioExecutionMax */,
                                                                                        C_Compiler * inCompiler
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP) ;
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (object->mAttribute_mOccurrenceFactor.mAttribute_uint, inCompiler COMMA_SOURCE_FILE_AT_LINE (743)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (object->mAttribute_mOccurrenceFactor.mAttribute_uint, inCompiler COMMA_SOURCE_FILE_AT_LINE (744)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_duration) ;
}

//---------------------------------------------------------------------------*

