pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETFIE duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                          const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                          const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                          const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                          const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                          GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                          GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                          GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                          GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                          GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                          GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                          C_Compiler * inCompiler
                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (809)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (810)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, ioArgument_ioExecutionMin.objectCompare (ioArgument_ioCurrentMin)).boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioExecutionMin = ioArgument_ioCurrentMin ;
  }
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, ioArgument_ioExecutionMax.objectCompare (ioArgument_ioCurrentMax)).boolEnum () ;
  if (kBoolTrue == test_1) {
    ioArgument_ioExecutionMax = ioArgument_ioCurrentMax ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETLW duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                         const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                         const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                         const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                         GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                         GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                         GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                         GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                         GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                         GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (833)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (834)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, ioArgument_ioExecutionMin.objectCompare (ioArgument_ioCurrentMin)).boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioExecutionMin = ioArgument_ioCurrentMin ;
  }
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, ioArgument_ioExecutionMax.objectCompare (ioArgument_ioCurrentMax)).boolEnum () ;
  if (kBoolTrue == test_1) {
    ioArgument_ioExecutionMax = ioArgument_ioCurrentMax ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_duration) ;
}

//---------------------------------------------------------------------------*

