pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_retlw duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                     const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                                     const GALGAS_symbolTableForOptimizations /* constinArgument_inSymbolTable */,
                                                                                                     const GALGAS_routineMinMaxMap /* constinArgument_inRoutineMinMaxMap */,
                                                                                                     const GALGAS_pic_31__38__5F_intermediate_5F_instructionList /* constinArgument_inGeneratedInstructionList */,
                                                                                                     GALGAS_uintlist & /* ioArgument_ioMinArray */,
                                                                                                     GALGAS_uintlist & /* ioArgument_ioMaxArray */,
                                                                                                     GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                                     GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                                     GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                                     GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                                     C_Compiler * inCompiler
                                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 11U), inCompiler COMMA_SOURCE_FILE_AT_LINE (860)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 11U), inCompiler COMMA_SOURCE_FILE_AT_LINE (861)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, ioArgument_ioExecutionMin.objectCompare (ioArgument_ioCurrentMin)).boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioExecutionMin = ioArgument_ioCurrentMin ;
  }
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, ioArgument_ioExecutionMax.objectCompare (ioArgument_ioCurrentMax)).boolEnum () ;
  if (kBoolTrue == test_1) {
    ioArgument_ioExecutionMax = ioArgument_ioCurrentMax ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//      Overriding category method '@pic18_intermediate_JUMP duration'       *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                         const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                         const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                         const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                         GALGAS_uintlist & ioArgument_ioMinArray,
                                                                         GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                         GALGAS_uint & ioArgument_ioCurrentMin,
                                                                         GALGAS_uint & ioArgument_ioCurrentMax,
                                                                         GALGAS_uint & ioArgument_ioExecutionMin,
                                                                         GALGAS_uint & ioArgument_ioExecutionMax,
                                                                         C_Compiler * inCompiler
                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (884)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (885)) ;
  {
  routine_computeMinMaxFromLabel (object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin, ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax, ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (887)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_conditionalBranch duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                     const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                                     const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                     const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                                     const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                     GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                                     GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                                     GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                                     GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                                     GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                                     GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                                     C_Compiler * inCompiler
                                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (915)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (916)) ;
  {
  routine_computeMinMaxFromLabel (object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (924)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (927)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (918)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_jump_test_register duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                             const GALGAS_uint constinArgument_inCurrentLine,
                                                                                             const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                             const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                             const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                             GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                             GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                             GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                             GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                             GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                             GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                             C_Compiler * inCompiler
                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction var_nextInstruction = constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inCurrentLine.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (947)), inCompiler COMMA_SOURCE_FILE_AT_LINE (947)) ;
  GALGAS_uint var_durationWhenSkip = GALGAS_uint ((PMUInt32) 1U).add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) var_nextInstruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (948)).divide_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (948)), inCompiler COMMA_SOURCE_FILE_AT_LINE (948)) ;
  {
  routine_computeMinMaxFromLine (constinArgument_inCurrentLine.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (950)), constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (955)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (958)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (949)) ;
  }
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (962)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (963)) ;
}
//---------------------------------------------------------------------------*

