pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_BitTestSkip duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                               const GALGAS_uint constinArgument_inCurrentLine,
                                                                                               const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                               const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                               const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                               GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                               GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                               GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                               GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                               GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                               GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                               C_Compiler * inCompiler
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction var_nextInstruction = constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inCurrentLine.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (981)), inCompiler COMMA_SOURCE_FILE_AT_LINE (981)) ;
  GALGAS_uint var_durationWhenSkip = GALGAS_uint ((PMUInt32) 1U).add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) var_nextInstruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (982)).divide_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (982)), inCompiler COMMA_SOURCE_FILE_AT_LINE (982)) ;
  {
  routine_computeMinMaxFromLine (constinArgument_inCurrentLine.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (984)), constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (989)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (992)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (983)) ;
  }
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (996)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (997)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_incDecRegisterInCondition duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                              const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                              const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                              const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                              const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                              GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                              GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                              GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                              GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                              GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                              GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                              C_Compiler * inCompiler
                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  {
  routine_computeMinMaxFromLabel (object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 3U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1021)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 3U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1024)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1015)) ;
  }
  //--- @ifExpressionForGeneration
  GALGAS_uint temp_0 ;
  const enumGalgasBool test_1 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_1) {
    temp_0 = GALGAS_uint ((PMUInt32) 1U) ;
  }else if (kBoolFalse == test_1) {
    temp_0 = GALGAS_uint ((PMUInt32) 2U) ;
  }
  GALGAS_uint var_durationWhenSkip = GALGAS_uint ((PMUInt32) 1U).add_operation (temp_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1028)) ;
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (1029)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (1030)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_bra duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                   const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                                   const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                   const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                                   const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                   GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                                   GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                                   GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                                   GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                                   GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                                   GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                                   C_Compiler * inCompiler
                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  GALGAS_uint var_duration = GALGAS_uint ((PMUInt32) 11U) ;
  cEnumerator_lstringlist enumerator_36110 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_36110.hasCurrentObject ()) {
    {
    routine_computeMinMaxFromLabel (enumerator_36110.current_mValue (HERE), constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (var_duration, inCompiler COMMA_SOURCE_FILE_AT_LINE (1058)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (var_duration, inCompiler COMMA_SOURCE_FILE_AT_LINE (1061)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1052)) ;
    }
    enumerator_36110.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_duration) ;
}

//---------------------------------------------------------------------------*

