pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_goto duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                    const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                                    const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                    const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                                    const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                    GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                                    GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                                    GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                                    GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                                    GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                                    GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                                    C_Compiler * inCompiler
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  GALGAS_uint var_duration = GALGAS_uint ((PMUInt32) 12U) ;
  cEnumerator_lstringlist enumerator_37138 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_37138.hasCurrentObject ()) {
    {
    routine_computeMinMaxFromLabel (enumerator_37138.current_mValue (HERE), constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (var_duration, inCompiler COMMA_SOURCE_FILE_AT_LINE (1092)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (var_duration, inCompiler COMMA_SOURCE_FILE_AT_LINE (1095)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1086)) ;
    }
    enumerator_37138.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_rcall duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                     const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                                     const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                     const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                                     const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                     GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                                     GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                                     GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                                     GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                                     GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                                     GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                                     C_Compiler * inCompiler
                                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  cEnumerator_lstringlist enumerator_38182 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  GALGAS_uint index_38176 ((PMUInt32) 0) ;
  while (enumerator_38182.hasCurrentObject ()) {
    //--- @ifExpressionForGeneration
    GALGAS_uint temp_0 ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, index_38176.objectCompare (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (1120)).substract_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1120)))).boolEnum () ;
    if (kBoolTrue == test_1) {
      temp_0 = GALGAS_uint ((PMUInt32) 2U) ;
    }else if (kBoolFalse == test_1) {
      temp_0 = GALGAS_uint ((PMUInt32) 0U) ;
    }
    GALGAS_uint var_duration = GALGAS_uint ((PMUInt32) 12U).add_operation (temp_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1120)) ;
    {
    routine_computeMinMaxFromLabel (enumerator_38182.current_mValue (HERE), constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (var_duration, inCompiler COMMA_SOURCE_FILE_AT_LINE (1127)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (var_duration, inCompiler COMMA_SOURCE_FILE_AT_LINE (1130)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1121)) ;
    }
    enumerator_38182.gotoNextObject () ;
    index_38176.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1119)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_duration, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_registerComparisonCondition duration'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                const GALGAS_uint /* constinArgument_inCurrentLine */,
                                                                                                const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                const GALGAS_routineMinMaxMap constinArgument_inRoutineMinMaxMap,
                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                                                GALGAS_uintlist & ioArgument_ioMinArray,
                                                                                                GALGAS_uintlist & ioArgument_ioMaxArray,
                                                                                                GALGAS_uint & ioArgument_ioCurrentMin,
                                                                                                GALGAS_uint & ioArgument_ioCurrentMax,
                                                                                                GALGAS_uint & ioArgument_ioExecutionMin,
                                                                                                GALGAS_uint & ioArgument_ioExecutionMax,
                                                                                                C_Compiler * inCompiler
                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  {
  routine_computeMinMaxFromLabel (object->mAttribute_mTargetLabel, constinArgument_inSymbolTable, constinArgument_inRoutineMinMaxMap, constinArgument_inGeneratedInstructionList, ioArgument_ioMinArray, ioArgument_ioCurrentMin.add_operation (GALGAS_uint ((PMUInt32) 3U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1157)), ioArgument_ioExecutionMin, ioArgument_ioMaxArray, ioArgument_ioCurrentMax.add_operation (GALGAS_uint ((PMUInt32) 3U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1160)), ioArgument_ioExecutionMax, inCompiler COMMA_SOURCE_FILE_AT_LINE (1151)) ;
  }
  //--- @ifExpressionForGeneration
  GALGAS_uint temp_0 ;
  const enumGalgasBool test_1 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_1) {
    temp_0 = GALGAS_uint ((PMUInt32) 1U) ;
  }else if (kBoolFalse == test_1) {
    temp_0 = GALGAS_uint ((PMUInt32) 2U) ;
  }
  GALGAS_uint var_durationWhenSkip = GALGAS_uint ((PMUInt32) 1U).add_operation (temp_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1164)) ;
  ioArgument_ioCurrentMin = ioArgument_ioCurrentMin.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (1165)) ;
  ioArgument_ioCurrentMax = ioArgument_ioCurrentMax.add_operation (var_durationWhenSkip, inCompiler COMMA_SOURCE_FILE_AT_LINE (1166)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_duration (void) {
  enterCategoryMethod_duration (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_duration) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_duration (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_duration, NULL) ;

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels_2E_element::GALGAS_symbolTableForStackLevels_2E_element (void) :
mAttribute_lkey (),
mAttribute_mStackLevel () {
}

//---------------------------------------------------------------------------*

