pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
GALGAS_symbolTableForStackLevels_2E_element::~ GALGAS_symbolTableForStackLevels_2E_element (void) {
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels_2E_element::GALGAS_symbolTableForStackLevels_2E_element (const GALGAS_lstring & inOperand0,
                                                                                          const GALGAS_uint & inOperand1) :
mAttribute_lkey (inOperand0),
mAttribute_mStackLevel (inOperand1) {
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels_2E_element GALGAS_symbolTableForStackLevels_2E_element::constructor_default (UNUSED_LOCATION_ARGS) {
  return GALGAS_symbolTableForStackLevels_2E_element (GALGAS_lstring::constructor_default (HERE),
                                                      GALGAS_uint::constructor_default (HERE)) ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels_2E_element GALGAS_symbolTableForStackLevels_2E_element::constructor_new (const GALGAS_lstring & inOperand0,
                                                                                                          const GALGAS_uint & inOperand1 
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_symbolTableForStackLevels_2E_element result ;
  if (inOperand0.isValid () && inOperand1.isValid ()) {
    result = GALGAS_symbolTableForStackLevels_2E_element (inOperand0, inOperand1) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_symbolTableForStackLevels_2E_element::objectCompare (const GALGAS_symbolTableForStackLevels_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_lkey.objectCompare (inOperand.mAttribute_lkey) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mStackLevel.objectCompare (inOperand.mAttribute_mStackLevel) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_symbolTableForStackLevels_2E_element::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mStackLevel.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_symbolTableForStackLevels_2E_element::drop (void) {
  mAttribute_lkey.drop () ;
  mAttribute_mStackLevel.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_symbolTableForStackLevels_2E_element::description (C_String & ioString,
                                                               const PMSInt32 inIndentation) const {
  ioString << "<struct @symbolTableForStackLevels.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_lkey.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mStackLevel.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_symbolTableForStackLevels_2E_element::reader_lkey (UNUSED_LOCATION_ARGS) const {
  return mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_symbolTableForStackLevels_2E_element::reader_mStackLevel (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mStackLevel ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                  @symbolTableForStackLevels.element type                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_symbolTableForStackLevels_2E_element ("symbolTableForStackLevels.element",
                                                             NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_symbolTableForStackLevels_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_symbolTableForStackLevels_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_symbolTableForStackLevels_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_symbolTableForStackLevels_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForStackLevels_2E_element GALGAS_symbolTableForStackLevels_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                                        C_Compiler * inCompiler,
                                                                                                        const GALGAS_location & inErrorLocation,
                                                                                                        const GALGAS_string & inErrorMessage
                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_symbolTableForStackLevels_2E_element result ;
  const GALGAS_symbolTableForStackLevels_2E_element * p = (const GALGAS_symbolTableForStackLevels_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_symbolTableForStackLevels_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap_2E_element::GALGAS_routineHasLoopMap_2E_element (void) :
mAttribute_lkey (),
mAttribute_mHasLoop () {
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap_2E_element::~ GALGAS_routineHasLoopMap_2E_element (void) {
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap_2E_element::GALGAS_routineHasLoopMap_2E_element (const GALGAS_lstring & inOperand0,
                                                                          const GALGAS_bool & inOperand1) :
mAttribute_lkey (inOperand0),
mAttribute_mHasLoop (inOperand1) {
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap_2E_element GALGAS_routineHasLoopMap_2E_element::constructor_default (UNUSED_LOCATION_ARGS) {
  return GALGAS_routineHasLoopMap_2E_element (GALGAS_lstring::constructor_default (HERE),
                                              GALGAS_bool::constructor_default (HERE)) ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap_2E_element GALGAS_routineHasLoopMap_2E_element::constructor_new (const GALGAS_lstring & inOperand0,
                                                                                          const GALGAS_bool & inOperand1 
                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_routineHasLoopMap_2E_element result ;
  if (inOperand0.isValid () && inOperand1.isValid ()) {
    result = GALGAS_routineHasLoopMap_2E_element (inOperand0, inOperand1) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_routineHasLoopMap_2E_element::objectCompare (const GALGAS_routineHasLoopMap_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_lkey.objectCompare (inOperand.mAttribute_lkey) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mHasLoop.objectCompare (inOperand.mAttribute_mHasLoop) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_routineHasLoopMap_2E_element::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mHasLoop.isValid () ;
}

//---------------------------------------------------------------------------*

