pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
void GALGAS_routineHasLoopMap_2E_element::drop (void) {
  mAttribute_lkey.drop () ;
  mAttribute_mHasLoop.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_routineHasLoopMap_2E_element::description (C_String & ioString,
                                                       const PMSInt32 inIndentation) const {
  ioString << "<struct @routineHasLoopMap.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_lkey.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mHasLoop.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_routineHasLoopMap_2E_element::reader_lkey (UNUSED_LOCATION_ARGS) const {
  return mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_routineHasLoopMap_2E_element::reader_mHasLoop (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mHasLoop ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                      @routineHasLoopMap.element type                      *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_routineHasLoopMap_2E_element ("routineHasLoopMap.element",
                                                     NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_routineHasLoopMap_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_routineHasLoopMap_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_routineHasLoopMap_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_routineHasLoopMap_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineHasLoopMap_2E_element GALGAS_routineHasLoopMap_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                        C_Compiler * inCompiler,
                                                                                        const GALGAS_location & inErrorLocation,
                                                                                        const GALGAS_string & inErrorMessage
                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_routineHasLoopMap_2E_element result ;
  const GALGAS_routineHasLoopMap_2E_element * p = (const GALGAS_routineHasLoopMap_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_routineHasLoopMap_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap_2E_element::GALGAS_routineMinMaxMap_2E_element (void) :
mAttribute_lkey (),
mAttribute_mMin (),
mAttribute_mMax () {
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap_2E_element::~ GALGAS_routineMinMaxMap_2E_element (void) {
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap_2E_element::GALGAS_routineMinMaxMap_2E_element (const GALGAS_lstring & inOperand0,
                                                                        const GALGAS_uint & inOperand1,
                                                                        const GALGAS_uint & inOperand2) :
mAttribute_lkey (inOperand0),
mAttribute_mMin (inOperand1),
mAttribute_mMax (inOperand2) {
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap_2E_element GALGAS_routineMinMaxMap_2E_element::constructor_default (UNUSED_LOCATION_ARGS) {
  return GALGAS_routineMinMaxMap_2E_element (GALGAS_lstring::constructor_default (HERE),
                                             GALGAS_uint::constructor_default (HERE),
                                             GALGAS_uint::constructor_default (HERE)) ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap_2E_element GALGAS_routineMinMaxMap_2E_element::constructor_new (const GALGAS_lstring & inOperand0,
                                                                                        const GALGAS_uint & inOperand1,
                                                                                        const GALGAS_uint & inOperand2 
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_routineMinMaxMap_2E_element result ;
  if (inOperand0.isValid () && inOperand1.isValid () && inOperand2.isValid ()) {
    result = GALGAS_routineMinMaxMap_2E_element (inOperand0, inOperand1, inOperand2) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_routineMinMaxMap_2E_element::objectCompare (const GALGAS_routineMinMaxMap_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_lkey.objectCompare (inOperand.mAttribute_lkey) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mMin.objectCompare (inOperand.mAttribute_mMin) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mMax.objectCompare (inOperand.mAttribute_mMax) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

