pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.cpp
bool GALGAS_routineMinMaxMap_2E_element::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mMin.isValid () && mAttribute_mMax.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_routineMinMaxMap_2E_element::drop (void) {
  mAttribute_lkey.drop () ;
  mAttribute_mMin.drop () ;
  mAttribute_mMax.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_routineMinMaxMap_2E_element::description (C_String & ioString,
                                                      const PMSInt32 inIndentation) const {
  ioString << "<struct @routineMinMaxMap.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_lkey.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mMin.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mMax.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_routineMinMaxMap_2E_element::reader_lkey (UNUSED_LOCATION_ARGS) const {
  return mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_routineMinMaxMap_2E_element::reader_mMin (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mMin ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_routineMinMaxMap_2E_element::reader_mMax (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mMax ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                      @routineMinMaxMap.element type                       *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_routineMinMaxMap_2E_element ("routineMinMaxMap.element",
                                                    NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_routineMinMaxMap_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_routineMinMaxMap_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_routineMinMaxMap_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_routineMinMaxMap_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_routineMinMaxMap_2E_element GALGAS_routineMinMaxMap_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                      C_Compiler * inCompiler,
                                                                                      const GALGAS_location & inErrorLocation,
                                                                                      const GALGAS_string & inErrorMessage
                                                                                      COMMA_LOCATION_ARGS) {
  GALGAS_routineMinMaxMap_2E_element result ;
  const GALGAS_routineMinMaxMap_2E_element * p = (const GALGAS_routineMinMaxMap_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_routineMinMaxMap_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


